import pandas as pd
# ============================================================
# ДАННЫЕ ОЗЕРА БАЛХАШ ЗА 2016 ГОД
# ============================================================

# Научно-исследовательский улов
data_2016_1 = pd.DataFrame.from_dict({
                'Date': ['01.07.2016','02.07.2016','03.07.2016','04.07.2016','05.07.2016','06.07.2016','07.07.2016',
                         '08.07.2016','09.07.2016','10.07.2016','11.07.2016'],
                'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм',
                               'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм',
                               'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                'Area': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                'сазан': [35, 54, 136, 26, 15, 41, 41, 71, 36, 14, 40],
    'лещ': [221, 43, 64, 35, 68, 58, 10, 50, 166, 6, 133],
    'жерех': [20, 8, 38, 4, 4, 15, 6, 25, 14, 4, 7],
    'плотва': [184, 158, 272, 25, 72, 101, 58, 179, 150, 64, 108],
    'карась': [35, 16, 48, 1, 2, 1, 2, 14, 4, 1, 0],
    'сом': [1, 2, 7, 0, 0, 14, 2, 6, 1, 0, 2],
    'судак': [13, 36, 69, 11, 11, 19, 73, 18, 25, 4, 15],
    'берш': [81, 24, 49, 30, 1, 43, 6, 19, 1, 2, 0],
    'змееголов': [9, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0]})
data_2016_1.insert(loc=4, column='CatchType', value='научный')
data_2016_1.loc[data_2016_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_1.loc[data_2016_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_1.insert(loc=1, column='Year', value=2016)

 #промысловый улов

data_2016_2 = pd.DataFrame.from_dict({
                'Date': ['02.07.2016','03.07.2016'],
                'Place': ['Западный Балхаш','Восточный Балхаш'],
                'Instrument': ['Невод', 'Невод'],
                'Instrument_size': [500, 500],
                'Area': [8.4, 8.4],
                'сазан': [7881, 37],'лещ': [503816, 35261],'жерех': [3940, 855],'плотва': [12384, 223],'карась': [2815, 111],'сом': [10133, 111],'судак': [10696, 557],'берш': [10133, 11],'змееголов': [450, 0]})
data_2016_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2016_2.loc[data_2016_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_2.loc[data_2016_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_2.insert(loc=1, column='Year', value=2016)

#------------------------------------------------------------

# общий улов в 2016 году
balkhash_catch_2016 = pd.concat([data_2016_1, data_2016_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2016 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                    'сазан': [2, 28, 70, 342, 191, 18, 6, 6, 4, 3, 0, 0, 0, 0, 0],
                                    'лещ': [26, 32, 124, 301, 338, 84, 30, 9, 3, 2, 0, 0, 0, 0, 0],
                                    'жерех': [3, 15, 35, 11, 56, 61, 14, 3, 0, 0, 0, 0, 0, 0, 0],
                                    'плотва': [12, 291, 277, 223, 542, 201, 15, 2, 0, 0, 0, 0, 0, 0, 0],
                                    'карась': [3, 16, 71, 22, 27, 30, 13, 2, 0, 1, 0, 0, 0, 0, 0],
                                    'сом': [0, 5, 10, 8, 6, 7, 3, 1, 2, 0, 5, 2, 0, 0, 0],
                                    'судак': [22, 62, 120, 82, 37, 15, 4, 8, 0, 0, 1, 0, 0, 0, 0],
                                    'берш': [4, 70, 90, 122, 46, 12, 0, 1, 0, 0, 0, 0, 0, 0, 0],
                                    'змееголов': [0, 1, 1, 5, 5, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0]})



if __name__ == '__main__':
    print(balkhash_catch_2016.shape)
    print(balkhash_catch_2016.columns)
    print(balkhash_catch_2016[['Date', 'Year']])#------------------------------------------------------------
