import pandas as pd

# =====================================================================
# ДАННЫЕ ОЗЕРА БАЛХАШ ЗА 2019 ГОД
# =====================================================================
#  Научно-исследовательский улов
data_2019_1 = pd.DataFrame.from_dict({
                    'Date': ['02.07.2018', '03.07.2018', '04.07.2018', '05.07.2018', '06.07.2018', '07.07.2018',
                                '08.07.2018', '09.07.2018', '10.07.2018', '11.07.2018', '12.07.2018'],
                    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                    'сазан': [7, 27, 72, 34, 35, 67, 13, 64, 8, 24, 28],'лещ': [4, 59, 11, 37, 6, 53, 64, 66, 30, 20, 35],'жерех': [13, 0, 41, 7, 1, 12, 2, 29, 6, 13, 38],'плотва': [167, 313, 44, 149, 134, 106, 35, 328, 70, 50, 78],'карась': [62, 1, 27, 5, 7, 6, 2, 16, 1, 2, 5],'сом': [3, 1, 2, 2, 0, 5, 0, 1, 1, 2, 1],'судак': [28, 35, 28, 25, 11, 35, 12, 93, 1, 6, 26],'берш': [44, 31, 34, 8, 25, 14, 21, 48, 0, 7, 1],'змееголов': [0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0]})

data_2019_1.insert(loc=4, column='CatchType', value='научный')
data_2019_1.loc[data_2019_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_1.loc[data_2019_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_1.insert(loc=1, column='Year', value=2019)

#промысловый улов
data_2019_2 = pd.DataFrame.from_dict({
                    'Date': ['03.07.2019','04.07.2019','05.07.2019','01.08.2019'],
                    'Place': ['Западный Балхаш','Восточный Балхаш','Западный Балхаш','Восточный Балхаш'],
                    'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
                    'Instrument_size': [100, 100, 500, 500],
                    'Area': [0.0, 0.0, 8.4, 8.4],
                    'сазан': [2037, 285, 1530, 1625],'лещ': [28641, 476, 152015, 87125],'жерех': [1296, 350, 170, 1409],'плотва': [20061, 4298, 10542, 8344],'карась': [1883, 78, 2040, 1951],'сом': [864, 380, 510, 759],'судак': [2716, 891, 2381, 4443],'берш': [3951, 1833, 340, 2492],'змееголов': [123, 43, 510, 217]})

data_2019_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2019_2.loc[data_2019_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_2.loc[data_2019_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_2.insert(loc=1, column='Year', value=2019)

# =====================================================================
# # Общий улов в 2018 году
# =====================================================================
balkhash_catch_2019 = pd.concat([data_2019_1, data_2019_2], ignore_index=True)

# =====================================================================
# # Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2019 = pd.DataFrame.from_dict({
                                        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                                                    'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                                 'сазан': [41, 180, 121, 138, 59, 15, 6, 3, 0, 0, 0, 0, 0, 0, 0],
                                                  'лещ': [38, 89, 78, 75, 142, 173, 74, 30, 6, 2, 0, 0, 0, 0, 0],
                                                  'жерех': [3, 26, 82, 37, 19, 16, 5, 7, 2, 0, 0, 0, 0, 0, 0],
                                                  'плотва': [4, 293, 735, 276, 690, 225, 15, 3, 0, 0, 0, 0, 0, 0, 0],
                                                  'карась': [13, 42, 51, 50, 27, 17, 13, 2, 0, 0, 0, 0, 0, 0, 0],
                                                  'сом': [0, 4, 6, 3, 4, 4, 2, 0, 0, 3, 1, 1, 0, 0, 0],
                                                  'судак': [14, 67, 136, 128, 41, 22, 6, 7, 5, 1, 1, 0, 0, 0, 0],
                                                  'берш': [0, 15, 102, 177, 47, 3, 0, 1, 0, 0, 0, 0, 0, 0, 0],
                                                  'змееголов': [0, 0, 4, 14, 7, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0]})


if __name__ == '__main__':
    print(balkhash_catch_2019.shape)
    print(balkhash_catch_2019.columns)
    print(balkhash_catch_2019[['Date', 'Year']])