import pandas as pd
# ============================================================
# ДАННЫЕ ОЗЕРА БАЛХАШ ЗА 2015 ГОД
# ============================================================

# Научно-исследовательский улов
data_2015_1 = pd.DataFrame.from_dict({
                'Date': ['01.07.2015', '02.07.2015', '03.07.2015', '04.07.2015', '01.08.2015', '02.08.2015',
                         '03.08.2015', '04.08.2015', '05.08.2015', '06.08.2015', '07.08.2015'],
                'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм',
                               'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                'Area': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                'сазан': [6, 10, 68, 19, 1, 20, 18, 10, 196, 27, 42],
    'лещ': [97, 28, 41, 20, 7, 76, 35, 21, 35, 7, 33],
    'жерех': [3, 6, 16, 1, 0, 5, 9, 0, 2, 2, 21],
    'плотва': [67, 15, 168, 50, 16, 360, 262, 82, 336, 236, 352],
    'карась': [1, 1, 7, 0, 0, 2, 1, 2, 0, 3, 0],
    'сом': [0, 0, 2, 1, 1, 0, 1, 0, 0, 1, 1],
    'судак': [20, 11, 33, 5, 1, 35, 24, 16, 2, 10, 27],
    'берш': [49, 27, 97, 25, 4, 29, 13, 12, 2, 1, 0],
    'змееголов': [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
})
data_2015_1.insert(loc=4, column='CatchType', value='научный')
data_2015_1.loc[data_2015_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_1.loc[data_2015_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_1.insert(loc=1, column='Year', value=2015)


#промысловый улов

data_2015_2 = pd.DataFrame.from_dict({

                'Date': ['01.07.2015','02.07.2015'],
                'Place': ['Западный Балхаш','Восточный Балхаш'],
                'Instrument': ['Невод', 'Невод'],
                'Instrument_size': [500, 500],
                'Area': [8.4, 8.4],
                'сазан': [2116, 92],
    'лещ': [50171, 42600],
    'жерех': [835, 1289],
    'плотва': [0, 0],
    'карась': [0, 414],
    'сом': [613, 507],
    'судак': [1893, 875],
    'берш': [22, 230],
    'змееголов': [0, 0]
})
data_2015_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2015_2.loc[data_2015_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_2.loc[data_2015_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_2.insert(loc=1, column='Year', value=2015)

#------------------------------------------------------------

# общий улов в 2015 году
balkhash_catch_2015 = pd.concat([data_2015_1, data_2015_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2015 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                            'сазан': [6, 19, 94, 98, 72, 11, 12, 8, 0, 0, 0, 0, 0, 0, 0],
                            'лещ': [42, 60, 66, 119, 76, 96, 58, 27, 10, 8, 0, 0, 0, 0, 0],
                            'жерех': [1, 4, 10, 22, 19, 25, 5, 2, 0, 0, 0, 0, 0, 0, 0],
                            'плотва': [9, 333, 474, 863, 930, 157, 32, 7, 0, 0, 0, 0, 0, 0, 0],
                            'карась': [0, 5, 9, 3, 10, 7, 6, 0, 0, 0, 0, 0, 0, 0, 0],
                            'сом': [0, 2, 1, 2, 0, 3, 0, 2, 5, 0, 0, 1, 0, 0, 0],
                            'судак': [14, 72, 58, 52, 26, 11, 6, 3, 1, 0, 0, 0, 0, 0, 0],
                            'берш': [5, 46, 123, 101, 27, 16, 3, 1, 0, 0, 0, 0, 0, 0, 0],
                            'змееголов': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]})


if __name__ == '__main__':
    print(balkhash_catch_2015.shape)
    print(balkhash_catch_2015.columns)
    print(balkhash_catch_2015[['Date', 'Year']])