import pandas as pd

# =====================================================================
# === ДАННЫЕ ВОДОЕМА BALKHASH ЗА 2024 ГОД ===
# =====================================================================

# Научно-исследовательский улов
data_2024_1 = pd.DataFrame.from_dict({
    'Date': ['01.07.2024', '02.07.2024', '03.07.2024', '04.07.2024', '05.07.2024', '06.07.2024', '07.07.2024',
             '08.07.2024', '09.07.2024', '10.07.2024', '11.07.2024'],
                                    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                                    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                                    'сазан': [56, 15, 60, 56, 120, 15, 40, 52, 11, 51, 20],'лещ': [230, 311, 27, 255, 93, 52, 82, 85, 165, 41, 147],'жерех': [16, 0, 15, 0, 4, 24, 35, 16, 12, 11, 10],'плотва': [75, 72, 189, 75, 61, 82, 163, 192, 62, 96, 105],'карась': [23, 11, 10, 26, 14, 17, 39, 0, 0, 0, 0],'сом': [2, 3, 8, 1, 0, 1, 6, 0, 0, 0, 0],'судак': [25, 48, 19, 12, 34, 44, 54, 21, 2, 7, 5],'берш': [31, 28, 55, 2, 139, 87, 17, 6, 0, 8, 0],'змееголов': [0, 7, 0, 1, 1, 0, 1, 0, 0, 0, 0]})

data_2024_1.insert(loc=4, column='CatchType', value='научный')
data_2024_1.loc[data_2024_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_1.loc[data_2024_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_1.insert(loc=1, column='Year', value=2024)


# Промысловый улов


data_2024_2 = pd.DataFrame.from_dict({
    'Date': ['02.07.2024', '04.07.2024', '05.07.2024', '01.08.2024'],

   'Place': ['Западный Балкаш', 'Восточный Балкаш', 'Западный Балкаш', 'Восточный Балкаш'],
   'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
    'Instrument_size': [200, 200, 1000, 1000],
    'Area': [0.0, 0.0, 8.4, 8.4],
                                    'сазан': [3, 0, 102, 2],'лещ': [42, 515, 18260, 1362],'жерех': [0, 7, 61, 6],'плотва': [1387, 6, 774, 0],'карась': [0, 0, 265, 0],'сом': [0, 19, 20, 4],'судак': [911, 635, 733, 471],'берш': [872, 672, 122, 19],'змееголов': [6, 0, 4, 0]})

data_2024_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2024_2.loc[data_2024_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_2.loc[data_2024_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_2.insert(loc=1, column='Year', value=2024)

# =====================================================================
# # Общий улов в 2024 году
# =====================================================================
balkhash_catch_2024 = pd.concat([data_2024_1, data_2024_2], ignore_index=True)


# =====================================================================
# Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2024 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7',
                'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13',
                'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                    'лещ': [33, 79, 135, 322, 498, 313, 75, 21, 9, 2, 1, 0, 0, 0, 0],
                                    'судак': [7, 62, 84, 35, 39, 24, 14, 2, 2, 0, 0, 0, 0, 0, 0],
                                    'жерех': [1, 2, 18, 48, 52, 9, 10, 1, 2, 0, 0, 0, 0, 0, 0],
                                    'плотва': [1, 151, 212, 177, 495, 107, 28, 1, 0, 0, 0, 0, 0, 0, 0],
                                    'сом': [0, 4, 3, 4, 3, 1, 1, 0, 0, 3, 2, 0, 0, 0, 0],
                                    'берш': [0, 0, 32, 112, 110, 87, 24, 6, 2, 0, 0, 0, 0, 0, 0],
                                    'карась': [1, 4, 18, 21, 38, 44, 12, 1, 1, 0, 0, 0, 0, 0, 0],
                                    'змееголов': [0, 0, 0, 5, 0, 3, 2, 0, 0, 0, 0, 0, 0, 0, 0],
                                    'сазан': [0, 22, 90, 111, 129, 91, 18, 12, 6, 5, 2, 0, 0, 0, 0]})

if __name__ == '__main__':
    print(balkhash_catch_2024.shape)
    print(balkhash_catch_2024.columns)
    print(balkhash_catch_2024[['Date', 'Year']])