import pandas as pd

# =====================================================================
# ДАННЫЕ ОЗЕРА БАЛХАШ ЗА 2017 ГОД (Таблица 1 - ВСЕ ДАННЫЕ НА МЕСТЕ)
# =====================================================================
# # Научно-исследовательский улов
data_2017_1 = pd.DataFrame.from_dict({
    'Date': ['01.07.2017', '02.07.2017', '03.07.2017', '04.07.2017', '05.07.2017', '06.07.2017', '07.07.2017',
             '08.07.2017', '09.07.2017', '10.07.2017', '11.07.2017'],
    'Place': ['I', 'II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X', 'XI'],
    'Instrument': ['Сети 16-100мм'] * 11,
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], # Для сетей установлены нули
    'сазан': [57, 26, 134, 9, 31, 37, 16, 15, 25, 25, 5],
    'лещ': [86, 46, 52, 33, 8, 57, 15, 11, 66, 21, 17],
    'жерех': [34, 0, 14, 2, 1, 5, 2, 4, 25, 7, 14],
    'плотва': [280, 127, 324, 197, 152, 103, 310, 26, 109, 103, 21],
    'карась': [18, 2, 33, 2, 3, 5, 13, 0, 11, 0, 0],
    'сом': [1, 0, 8, 0, 1, 10, 0, 1, 6, 2, 1],
    'судак': [91, 39, 199, 11, 36, 32, 26, 11, 25, 17, 12],
    'берш': [254, 12, 97, 7, 6, 28, 26, 28, 0, 17, 1],
    'змееголов': [4, 0, 3, 0, 0, 1, 1, 0, 0, 0, 0]
})

data_2017_1.insert(loc=4, column='CatchType', value='научный')
data_2017_1.loc[data_2017_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_1.loc[data_2017_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_1.insert(loc=1, column='Year', value=2017)


# =====================================================================
# # Промысловый улов
# ДАННЫЕ ОЗЕРА БАЛХАШ ЗА 2017 ГОД (Таблица 2 - ВСЕ ДАННЫЕ НА МЕСТЕ)
# =====================================================================
data_2017_2 = pd.DataFrame.from_dict({
    'Date': ['03.07.2017', '04.07.2017', '05.07.2017', '01.08.2017'],
    'Place': ['Западный Балхаш', 'Восточный Балхаш', 'Западный Балхаш', 'Восточный Балхаш'],
    'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
    'Instrument_size': [200, 200, 500, 500],
    'Area': [0.0, 0.0, 8.4, 8.4], # Сети — 0.0, Промысловый Невод — 8.4
    'сазан': [282, 3, 175, 36],
    'лещ': [2523, 64, 42000, 34726],
    'жерех': [97, 6, 350, 433],
    'плотва': [333, 12, 88, 0],
    'карась': [162, 0, 88, 0],
    'сом': [182, 0, 219, 72],
    'судак': [251, 22, 263, 757],
    'берш': [31, 34, 525, 0]
})

data_2017_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2017_2.loc[data_2017_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_2.loc[data_2017_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_2.insert(loc=1, column='Year', value=2017)

# =====================================================================
# # Общий улов в 2017 году
# =====================================================================
balkhash_catch_2017 = pd.concat([data_2017_1, data_2017_2], ignore_index=True)


# =====================================================================
# # Количество рыб, подвергнутых биологической обработке по возрастам
# ДАННЫЕ ЗА 2017 ГОД (Таблица 3 - Расширена до 16 лет, данные на месте)
# =====================================================================
qty_treated_fish_2017 = pd.DataFrame.from_dict({
    'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7',
                'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13',
                'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
    'сазан': [9, 106, 70, 135, 112, 37, 15, 13, 6, 2, 0, 0, 0, 0, 0],
    'лещ': [35, 130, 85, 62, 94, 159, 47, 12, 4, 0, 0, 0, 0, 0, 0],
    'жерех': [33, 15, 14, 4, 18, 27, 9, 1, 0, 0, 0, 0, 0, 0, 0],
    'плотва': [12, 640, 351, 561, 521, 164, 58, 26, 4, 0, 0, 0, 0, 0, 0],
    'карась': [2, 18, 21, 31, 49, 20, 11, 5, 0, 0, 0, 0, 0, 0, 0],
    'сом': [0, 11, 8, 7, 11, 1, 5, 2, 0, 5, 2, 0, 0, 0, 0],
    'судак': [44, 134, 224, 106, 21, 31, 11, 15, 6, 2, 0, 0, 0, 0, 0],
    'берш': [2, 81, 219, 201, 82, 21, 3, 0, 0, 0, 0, 0, 0, 0, 0],
    'змееголов': [0, 0, 0, 4, 4, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
})


if __name__ == '__main__':
    print(balkhash_catch_2017.shape)
    print(balkhash_catch_2017.columns)
    print(balkhash_catch_2017[['Date', 'Year']])
    #------------------------------------------------------------
