import pandas as pd

# === ДАННЫЕ ВОДОЕМА BALKHASH ЗА 2022 ГОД ===

# Научно-исследовательский улов
data_2022_1 = pd.DataFrame.from_dict({
    'Date': ['01.07.2022', '02.07.2022', '03.07.2022', '04.07.2022', '05.07.2022', '06.07.2022', '07.07.2022',
             '08.07.2022', '09.07.2022', '10.07.2022', '11.07.2022'],
                                    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                                    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                                    'сазан': [14, 21, 28, 4, 21, 27, 31, 28, 5, 18, 9],'лещ': [20, 26, 22, 18, 30, 16, 74, 30, 26, 32, 445],'жерех': [2, 2, 4, 2, 0, 9, 5, 9, 13, 10, 6],'плотва': [5, 154, 35, 67, 28, 52, 166, 167, 162, 154, 76],'карась': [17, 6, 5, 0, 4, 18, 18, 2, 8, 2, 0],'сом': [0, 1, 1, 0, 2, 2, 0, 4, 0, 1, 0],'судак': [13, 38, 24, 8, 12, 28, 30, 53, 9, 8, 3],'берш': [14, 24, 8, 2, 12, 43, 15, 13, 3, 13, 0],'змееголов': [7, 1, 6, 0, 0, 0, 2, 0, 0, 0, 0]})

data_2022_1.insert(loc=4, column='CatchType', value='научный')
data_2022_1.loc[data_2022_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_1.loc[data_2022_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_1.insert(loc=1, column='Year', value=2022)


# Промысловый улов


data_2022_2 = pd.DataFrame.from_dict({
    'Date': ['01.07.2022', '02.07.2022', '04.07.2022', '05.07.2022'],

   'Place': ['Западный Балкаш', 'Восточный Балкаш', 'Западный Балкаш', 'Восточный Балкаш'],
   'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
    'Instrument_size': [200, 200, 1000, 1000],
    'Area': [0.0, 0.0, 8.4, 8.4],
                                    'сазан': [67, 111, 44, 200],'лещ': [35, 266, 4663, 63115],'жерех': [10, 44, 71, 333],'плотва': [261, 405, 0, 200],'карась': [28, 52, 0, 0],'сом': [2, 10, 0, 865],'судак': [19, 51, 715, 1729],'берш': [48, 55, 0, 67],'змееголов': [14, 2, 0, 0]})

data_2022_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2022_2.loc[data_2022_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_2.loc[data_2022_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_2.insert(loc=1, column='Year', value=2022)

# =====================================================================
# # Общий улов в 2022 году
# =====================================================================
balkhash_catch_2022 = pd.concat([data_2022_1, data_2022_2], ignore_index=True)


# =====================================================================
# Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2022 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7',
                'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13',
                'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                    'лещ': [23, 17, 56, 286, 334, 157, 51, 20, 2, 2, 0, 0, 0, 0, 0],
                                    'судак': [9, 14, 92, 104, 23, 22, 5, 2, 1, 1, 0, 0, 0, 0, 0],
                                    'жерех': [5, 11, 5, 8, 24, 19, 11, 1, 0, 0, 0, 0, 0, 0, 0],
                                    'плотва': [34, 183, 70, 1136, 1965, 207, 27, 1, 0, 0, 0, 0, 0, 0, 0],
                                    'сом': [0, 1, 2, 2, 1, 0, 1, 4, 0, 2, 1, 1, 0, 0, 0],
                                    'берш': [0, 44, 17, 43, 129, 147, 55, 12, 1, 0, 0, 0, 0, 0, 0],
                                    'карась': [3, 16, 53, 55, 62, 22, 9, 2, 0, 0, 0, 0, 0, 0, 0],
                                    'змееголов': [0, 1, 1, 6, 7, 3, 5, 2, 1, 0, 0, 0, 0, 0, 0],
                                    'сазан': [1, 11, 40, 98, 202, 66, 31, 8, 6, 1, 2, 3, 0, 0, 0]})
if __name__ == '__main__':
    print(balkhash_catch_2022.shape)
    print(balkhash_catch_2022.columns)
    print(balkhash_catch_2022[['Date', 'Year']])