import pandas as pd

# === ДАННЫЕ ВОДОЕМА BALKHASH ЗА 2023 ГОД ===
# Научно-исследовательский улов
data_2023_1 = pd.DataFrame.from_dict({
    'Date': ['01.07.2023', '02.07.2023', '03.07.2023', '04.07.2023', '05.07.2023', '06.07.2023', '07.07.2023',
             '08.07.2023', '09.07.2023', '10.07.2023', '11.07.2023'],
                                    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                                    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                                    'сазан': [25, 3, 27, 6, 2, 8, 17, 14, 3, 11, 2],'лещ': [55, 43, 10, 23, 2, 6, 29, 49, 88, 32, 92],'жерех': [40, 3, 6, 3, 1, 2, 3, 1, 5, 5, 0],'плотва': [27, 63, 31, 35, 19, 42, 59, 96, 41, 114, 165],'карась': [13, 9, 8, 8, 7, 0, 24, 1, 0, 1, 0],'сом': [1, 1, 1, 1, 2, 0, 2, 1, 0, 1, 0],'судак': [15, 18, 17, 16, 4, 7, 10, 11, 0, 13, 0],'берш': [20, 6, 20, 3, 5, 12, 21, 11, 0, 0, 0],'змееголов': [8, 1, 7, 1, 0, 0, 3, 0, 0, 0, 0]})

data_2023_1.insert(loc=4, column='CatchType', value='научный')
data_2023_1.loc[data_2023_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_1.loc[data_2023_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_1.insert(loc=1, column='Year', value=2023)


# Промысловый улов


data_2023_2 = pd.DataFrame.from_dict({
    'Date': ['01.07.2023', '02.07.2023', '03.07.2023', '04.07.2023'],

   'Place': ['Западный Балкаш', 'Восточный Балкаш', 'Западный Балкаш', 'Восточный Балкаш'],
   'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
    'Instrument_size': [200, 200, 1000, 1000],
    'Area': [0.0, 0.0, 8.4, 8.4],
                                    'сазан': [3, 0, 100, 2],'лещ': [39, 491, 17857, 1269],'жерех': [0, 7, 60, 5],'плотва': [1296, 5, 756, 0],'карась': [0, 0, 259, 0],'сом': [42, 18, 20, 3],'судак': [851, 606, 717, 439],'берш': [815, 642, 119, 17],'змееголов': [6, 0, 4, 0]})

data_2023_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2023_2.loc[data_2023_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_2.loc[data_2023_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_2.insert(loc=1, column='Year', value=2023)

# =====================================================================
# # Общий улов в 2023 году
# =====================================================================
balkhash_catch_2023 = pd.concat([data_2023_1, data_2023_2], ignore_index=True)


# =====================================================================
# Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2023 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7',
                'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13',
                'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                    'лещ': [28, 14, 40, 302, 313, 125, 41, 8, 4, 4, 0, 0, 0, 0, 0],
                                    'судак': [5, 16, 55, 116, 18, 24, 4, 5, 1, 3, 0, 0, 0, 0, 0],
                                    'жерех': [0, 2, 10, 29, 18, 12, 11, 2, 0, 0, 0, 0, 0, 0, 0],
                                    'плотва': [18, 169, 210, 352, 844, 209, 4, 2, 0, 0, 0, 0, 0, 0, 0]  ,
                                    'сом': [0, 1, 4, 2, 5, 0, 2, 0, 1, 1, 0, 0, 0, 0, 0],
                                    'берш': [0, 1, 4, 2, 5, 0, 2, 0, 1, 1, 0, 0, 0, 0, 0],
                                    'карась': [2, 11, 42, 39, 55, 34, 4, 4, 1, 0, 0, 0, 0, 0, 0],
                                    'змееголов': [0, 5, 2, 3, 4, 3, 5, 2, 0, 0, 0, 0, 0, 0, 0],
                                    'сазан': [0, 13, 23, 45, 92, 57, 18, 7, 2, 3, 2, 2, 0, 0, 0]})


if __name__ == '__main__':
    print(balkhash_catch_2023.shape)
    print(balkhash_catch_2023.columns)
    print(balkhash_catch_2023[['Date', 'Year']])