import pandas as pd
# =====================================================================
# === ДАННЫЕ ВОДОЕМА BALKHASH ЗА 2020 ГОД ===
# =====================================================================

# Научно-исследовательский улов
data_2020_1 = pd.DataFrame.from_dict({
    'Date': ['02.07.2020', '03.07.2020', '04.07.2020', '05.07.2020', '06.07.2020', '07.07.2020',
             '08.07.2020', '09.07.2020', '10.07.2020', '11.07.2020', '12.07.2020'],
    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'сазан': [143, 34, 26, 80, 42, 111, 42, 3, 11, 106, 78],'лещ': [31, 0, 44, 20, 5, 9, 6, 24, 22, 31, 42],'жерех': [38, 3, 22, 23, 27, 3, 8, 0, 3, 26, 54],'плотва': [102, 66, 51, 24, 26, 176, 52, 4, 161, 114, 91],'карась': [18, 7, 2, 6, 2, 30, 14, 0, 1, 5, 5],'сом': [3, 0, 3, 1, 2, 4, 2, 0, 0, 3, 2],'судак': [14, 21, 6, 34, 15, 10, 11, 7, 9, 13, 4],'берш': [38, 15, 30, 12, 11, 3, 9, 2, 2, 6, 0],'змееголов': [5, 1, 2, 0, 0, 3, 0, 0, 0, 0, 1]})

data_2020_1.insert(loc=4, column='CatchType', value='научный')
data_2020_1.loc[data_2020_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_1.loc[data_2020_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_1.insert(loc=1, column='Year', value=2020)


# Промысловый улов


data_2020_2 = pd.DataFrame.from_dict({
    'Date': ['02.07.2020', '03.07.2020', '04.07.2020', '05.07.2020'],

   'Place': ['Западный Балкаш', 'Восточный Балкаш', 'Западный Балкаш', 'Восточный Балкаш'],
   'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
    'Instrument_size': [100, 100, 500, 500],
    'Area': [0.0, 0.0, 8.4, 8.4],
    'сазан': [60, 88, 132, 482],'лещ': [3182, 802, 121772, 87710],'жерех': [72, 118, 2643, 1640],'плотва': [332, 2036, 921, 2219],'карась': [96, 483, 132, 289],'сом': [28, 130, 132, 193],'судак': [140, 222, 4471, 2123],'берш': [80, 277, 1052, 1640],'змееголов': [12, 42, 53, 68]})

data_2020_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2020_2.loc[data_2020_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_2.loc[data_2020_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_2.insert(loc=1, column='Year', value=2020)

# =====================================================================
# # Общий улов в 2020 году
# =====================================================================
balkhash_catch_2020 = pd.concat([data_2020_1, data_2020_2], ignore_index=True)


# =====================================================================
# Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2020 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7',
                'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13',
                'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                'лещ': [23, 12, 57, 84, 142, 180, 58, 57, 21, 4, 0, 0, 0, 0, 0],
                'судак': [6, 13, 39, 77, 25, 15, 14, 4, 1, 1, 0, 0, 0, 0, 0],
                'жерех': [4, 3, 49, 64, 67, 54, 11, 2, 1, 0, 0, 0, 0, 0, 0],
                'плотва': [4, 238, 466, 141, 445, 194, 15, 0, 0, 0, 0, 0, 0, 0, 0],
                'сом': [0, 6, 5, 5, 4, 3, 1, 1, 0, 0, 0, 0, 0, 0, 0],
                'берш': [0, 20, 33, 121, 40, 6, 1, 0, 0, 0, 0, 0, 0, 0, 0],
                'карась': [1, 20, 45, 58, 39, 22, 13, 2, 1, 2, 0, 1, 0, 0, 0],
                'змееголов': [0, 0, 1, 6, 13, 10, 2, 0, 1, 0, 0, 0, 0, 0, 0],
                'сазан': [7, 166, 329, 235, 167, 46, 29, 3, 3, 6, 2, 1, 0, 0, 0]})


if __name__ == '__main__':
    print(balkhash_catch_2020.shape)
    print(balkhash_catch_2020.columns)
    print(balkhash_catch_2020[['Date', 'Year']])