import pandas as pd

# === ДАННЫЕ ВОДОЕМА BALKHASH ЗА 2018 ГОД ===
# =====================================================================
# # Научно-исследовательский улов
# ДАННЫЕ ОЗЕРА БАЛХАШ ЗА 2018===========================================
data_2018_1 = pd.DataFrame.from_dict({
                                    'Date': ['01.07.2018', '02.07.2018', '03.07.2018', '04.07.2018', '05.07.2018', '06.07.2018', '07.07.2018',
                                                '08.07.2018', '09.07.2018', '10.07.2018', '11.07.2018'],
                                    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                                    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                                    'сазан': [33, 13, 24, 1, 70, 6, 21, 25, 14, 13, 35],'лещ': [12, 24, 8, 35, 31, 1, 33, 25, 20, 3, 65],'жерех': [11, 12, 11, 0, 0, 3, 20, 14, 19, 13, 15],'плотва': [47, 77, 42, 104, 56, 108, 188, 283, 58, 106, 36],'карась': [10, 4, 15, 6, 54, 0, 3, 0, 0, 5, 21],'сом': [6, 6, 24, 0, 0, 1, 7, 0, 3, 1, 1],'судак': [31, 30, 17, 15, 11, 23, 53, 20, 5, 5, 49],'берш': [53, 10, 5, 5, 3, 5, 10, 16, 8, 13, 0],'змееголов': [1, 0, 2, 1, 7, 0, 1, 0, 0, 0, 2]})


data_2018_1.insert(loc=4, column='CatchType', value='научный')
data_2018_1.loc[data_2018_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_1.loc[data_2018_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_1.insert(loc=1, column='Year', value=2018)

#промысловый улов

data_2018_2 = pd.DataFrame.from_dict({
                                     'Date': ['02.07.2018','03.07.2018', '05.07.2018','01.08.2018'],
                                    'Place': ['Западный Балхаш','Восточный Балхаш', 'Западный Балхаш','Восточный Балхаш'],
                                    'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'Невод', 'Невод'],
                                    'Instrument_size': [100, 100, 500, 500],
                                    'Area': [0.0, 0.0, 8.4, 8.4],
                                    'сазан': [278, 220, 5603, 4139],'лещ': [141, 289, 221987, 113547],'жерех': [40, 49, 4269, 1932],'плотва': [0, 0, 16009, 7864],'карась': [64, 21, 3735, 1932],'сом': [41, 53, 1067, 690],'судак': [275, 34, 9072, 4967],'берш': [0, 48, 3735, 2483]})

data_2018_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2018_2.loc[data_2018_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_2.loc[data_2018_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_2.insert(loc=1, column='Year', value=2018)

# =====================================================================
# # Общий улов в 2018 году
# =====================================================================
balkhash_catch_2018 = pd.concat([data_2018_1, data_2018_2], ignore_index=True)


# =====================================================================
# # Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2018 = pd.DataFrame.from_dict({
                                        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                                                    'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                                  'сазан': [48, 94, 46, 49, 13, 5, 3, 1, 1, 2, 2, 1, 0, 0, 0],
                                                  'лещ': [7, 52, 63, 64, 27, 22, 19, 2, 1, 0, 0, 0, 0, 0, 0],
                                                  'жерех': [9, 23, 26, 16, 14, 6, 6, 5, 1, 0, 0, 0, 0, 0, 0],
                                                  'плотва': [0, 91, 219, 288, 336, 153, 16, 2, 0, 0, 0, 0, 0, 0, 0],
                                                  'карась': [5, 20, 25, 23, 18, 14, 11, 1, 0, 1, 0, 0, 0, 0, 0],
                                                  'сом': [8, 9, 5, 6, 8, 8, 3, 0, 0, 1, 4, 0, 0, 0, 0],
                                                  'судак': [20, 77, 76, 78, 22, 14, 1, 0, 0, 0, 0, 0, 0, 0, 0],
                                                  'берш': [0, 14, 33, 71, 23, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0],
                                                  'змееголов': [0, 1, 3, 7, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0]})

if __name__ == '__main__':
    print(balkhash_catch_2018.shape)
    print(balkhash_catch_2018.columns)
    print(balkhash_catch_2018[['Date', 'Year']])
    #------------------------------------------------------------
