import pandas as pd

# === ДАННЫЕ ВОДОЕМА BALKHASH ЗА 2021 ГОД ===

data_2021_1 = pd.DataFrame.from_dict({
                    'Date': ['01.07.2021', '02.07.2021', '03.07.2021', '04.07.2021', '05.07.2021', '06.07.2021', '07.07.2021',
                     '08.07.2021', '09.07.2021', '10.07.2021', '11.07.2021'],
                    'Place': ['I','II','III','IV','V','VI','VII','VIII','IX','X','XI'],
                    'Instrument': ['Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм', 'Сети 16-100мм'],
                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                    'сазан': [17, 29, 25, 37, 58, 164, 80, 52, 11, 51, 20],'лещ': [50, 33, 1, 25, 3, 14, 93, 85, 165, 41, 147],'жерех': [9, 21, 6, 6, 3, 47, 46, 19, 15, 17, 24],'плотва': [93, 57, 6, 73, 41, 87, 135, 192, 62, 96, 105],'карась': [37, 7, 12, 5, 7, 7, 6, 1, 0, 2, 16],'сом': [6, 0, 1, 0, 1, 4, 7, 1, 5, 3, 2],'судак': [31, 34, 4, 14, 8, 33, 29, 21, 3, 7, 5],'берш': [17, 10, 6, 14, 57, 30, 27, 6, 1, 8, 2],'змееголов': [3, 2, 3, 1, 1, 0, 2, 0, 0, 0, 0]})

data_2021_1.insert(loc=4, column='CatchType', value='научный')
data_2021_1.loc[data_2021_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_1.loc[data_2021_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_1.insert(loc=1, column='Year', value=2021)


# Промысловый улов


data_2021_2 = pd.DataFrame.from_dict({
                'Date': ['02.07.2021', '03.07.2021', '04.07.2021', '05.07.2021'],
               'Place': ['Западный Балкаш', 'Восточный Балкаш', 'Западный Балкаш', 'Восточный Балкаш'],
               'Instrument': ['Сети 50-80мм', 'Сети 50-80мм', 'невод', 'невод'],
                'Instrument_size': [200, 200, 1000, 1000],
                'Area': [0.0, 0.0, 8.4, 8.4],
                'лещ': [7, 10, 94, 69],'жерех': [34, 43, 1, 1],'плотва': [7, 2, 1, 0],'карась': [2, 2, 0, 0],'сом': [4, 6, 0, 0],'судак': [7, 6, 4, 24],'берш': [2, 0, 0, 4],'змееголов': [367, 1267, 46815, 19749]})
data_2021_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2021_2.loc[data_2021_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_2.loc[data_2021_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_2.insert(loc=1, column='Year', value=2021)

# =====================================================================
# # Общий улов в 2021 году
# =====================================================================
balkhash_catch_2021 = pd.concat([data_2021_1, data_2021_2], ignore_index=True)


# =====================================================================
# Количество рыб, подвергнутых биологической обработке по возрастам
# =====================================================================
qty_treated_fish_2021 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7',
                'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13',
                'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                'лещ': [12, 32, 155, 753, 351, 101, 30, 18, 4, 1, 0, 0, 0, 0, 0],
                'судак': [2, 14, 95, 113, 47, 41, 10, 5, 1, 1, 0, 1, 0, 0, 0],
                'жерех': [1, 5, 21, 62, 111, 73, 10, 0, 0, 0, 0, 0, 0, 0, 0],
                'плотва': [1, 113, 232, 472, 365, 86, 15, 5, 3, 0, 0, 0, 0, 0, 0],
                'сом': [2, 1, 5, 14, 5, 0, 0, 3, 2, 1, 2, 0, 0, 0, 0],
                'берш': [0, 7, 10, 78, 238, 190, 57, 9, 1, 0, 0, 0, 0, 0, 0],
                'карась': [1, 20, 70, 43, 0, 29, 12, 11, 1, 0, 0, 0, 0, 0, 0],
                'змееголов': [0, 0, 1, 1, 5, 10, 7, 4, 4, 1, 0, 0, 0, 0, 0],
                'сазан': [0, 6, 86, 291, 188, 86, 20, 9, 5, 4, 2, 1, 0, 0, 0]})



if __name__ == '__main__':
    print(balkhash_catch_2021.shape)
    print(balkhash_catch_2021.columns)
    print(balkhash_catch_2021[['Date', 'Year']])