import pandas as pd

# === ДАННЫЕ ВОДОЕМА KAPCHAGAY ЗА 2019 ГОД ===

data_2019_1 = pd.DataFrame.from_dict({
    'Date': [
    '03.04.2019', '05.04.2019', '06.04.2019', '08.04.2019', '11.04.2019',
    '13.04.2019', '14.04.2019', '05.05.2019', '06.05.2019', '07.05.2019',
    '08.05.2019', '09.05.2019', '10.05.2019', '11.05.2019', '12.05.2019',
    '13.05.2019', '14.05.2019', '15.05.2019', '16.05.2019', '18.05.2019',
    '20.05.2019', '21.05.2019', '13.07.2019', '14.07.2019', '24.07.2019',
    '25.07.2019', '26.07.2019', '27.07.2019', '28.07.2019', '29.07.2019',
    '30.07.2019', '31.07.2019', '01.08.2019', '03.08.2019', '04.08.2019',
    '06.08.2019', '07.08.2019', '08.08.2019', '09.08.2019', '10.08.2019',
    '11.09.2019', '12.09.2019', '13.09.2019', '14.09.2019', '15.09.2019',
    '16.09.2019', '18.09.2019', '19.09.2019', '20.09.2019', '21.09.2019',
    '27.09.2019', '28.09.2019', '29.09.2019'
],

    'Place': [
    'Каракольский залив', 'Каракольский залив', 'Каракольский залив', 'Каракольский залив',
    'Каракольский залив', 'Каракольский залив', 'Каракольский залив', '9 насосный станция',
    '9 насосный станция', '7 насосный станция', '9 насосный станция', '5 насосный станция',
    '5 насосный станция', '5 насосный станция', 'о. Шенгельды', 'МВД', '№10', 'Устья р. Караозек',
    'Устья р. Каскелен', 'Каракольский залив', 'Карашенгель', 'Карашенгель', 'МВД', 'Устья р. Каскелен',
    'Каракольский залив', '№4', 'Соленый озеро', 'Карашенгель', 'Карашенгель', '№10', 'Устья р. Караозек',
    '№12 А', 'Устья р. Каскелен', 'МВД', 'о. Шенгельды', '5 насосный станция', '№7', '7 насосный станция',
    '9 насосный станция', '9 насосный станция', '9 насосный станция', '7 насосный станция',
    '5 насосный станция', 'о. Шенгельды', 'МВД', 'МВД', 'Устья р. Каскелен', 'Устья р. Караозек',
    'Устья р. Есык', 'Устья р. Есык', 'Карашенгель', 'Соленый озеро', 'Каракольский залив'
],

    'Instrument': ['Сети 20-100мм'] * 53,
    'Instrument_size': [
    50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50,
    50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50,
    50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50
],
    'Area': [
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0
],

     'лещ': [
        1, 24, 29, 15, 36, 9, 0, 0, 117, 21, 44, 19, 35, 0, 51, 22, 17, 23, 19, 0,
        12, 7, 0, 0, 9, 3, 7, 6, 9, 19, 10, 10, 5, 5, 0, 6, 7, 4, 4, 26, 0, 18,
        16, 10, 4, 0, 0, 0, 0, 19, 4, 0, 0
    ],

    'судак': [
        0, 0, 10, 3, 5, 11, 7, 3, 0, 5, 2, 2, 3, 7, 0, 2, 11, 7, 7, 12, 11, 14,
        4, 0, 3, 11, 0, 0, 0, 6, 0, 17, 0, 9, 16, 14, 6, 0, 0, 3, 7, 5, 8, 10,
        31, 30, 0, 0, 0, 2, 8, 7, 7
    ],

    'сазан': [
        3, 1, 1, 10, 13, 12, 11, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 2, 0,
        0, 0, 4, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 3,
        4, 1, 0, 0, 0, 0, 1
    ],

    'сом': [
        0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 9, 0, 0, 4, 4, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 0, 0,
        0, 0, 0, 0, 0
    ],

    'жерех': [
        1, 0, 0, 2, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
        6, 20, 7, 15, 0
    ],

    'б_амур': [
        0, 0, 0, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 1, 0, 0, 0
    ],

    'т_лоб': [
        0, 0, 0, 2, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 3, 1, 1
    ],

    'карась': [
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 3, 0, 0, 0, 0, 1, 0, 0, 0,
        2, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 0, 6, 9, 2,
        0, 0, 0, 2, 0
    ],

    'плотва': [
        18, 0, 5, 5, 6, 14, 1, 0, 35, 32, 24, 61, 15, 0, 49, 12, 6, 0, 0, 0, 2,
        0, 10, 4, 0, 7, 0, 0, 0, 7, 6, 5, 8, 23, 0, 13, 25, 26, 11, 45, 0, 50,
        37, 33, 15, 0, 28, 16, 17, 0, 7, 10, 8
    ],

    'змееголов': [
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0,
        0, 0, 0, 0, 1
    ]})

data_2019_1.insert(loc=4, column='CatchType', value='научный')
data_2019_1.loc[data_2019_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_1.loc[data_2019_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_1.insert(loc=1, column='Year', value=2019)

#промысловый улов

data_2019_2 = pd.DataFrame.from_dict({
 'Date': [
        '10.05.2019', '13.05.2019', '14.05.2019', '24.07.2019', '26.07.2019', '28.07.2019', '29.07.2019', '03.08.2019',
        '07.08.2019', '10.08.2019', '13.09.2019', '14.09.2019', '16.09.2019', '18.09.2019', '21.09.2019', '29.09.2019'
    ],

    'Place': [
        '№6 пром.участок', '№11 пром.участок', '№12 пром.участок', '№23 пром.участок', '№24 пром.участок',
        '№18 пром.участок', '№16 пром.участок', '№8 пром.участок', '№7 пром.участок', '№3 пром.участок',
        '№5 пром.участок', '№8 пром.участок', '№11 пром.участок', '№12 пром.участок', '№17 пром.участок', '№24 пром.участок'
    ],
'Instrument': ['Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм',
               'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм',
               'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм']
,
'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
'лещ': [17, 11, 9, 15, 22, 11, 9, 15, 9, 17, 22, 15, 11, 17, 11, 15],
'судак': [12, 15, 11, 18, 15, 13, 11, 10, 5, 15, 18, 22, 4, 10, 9, 20],
'сазан': [0, 0, 3, 1, 0, 0, 0, 0, 0, 2, 0, 1, 5, 4, 2, 1],
'сом': [0, 0, 1, 0, 3, 0, 2, 0, 0, 0, 0, 1, 0, 5, 4, 0],
'жерех': [2, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 3, 7, 4, 18],
'б_амур': [0, 0, 2, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0],
'т_лоб': [0, 0, 0, 2, 0, 1, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0],
'карась': [7, 0, 5, 9, 0, 3, 0, 3, 0, 7, 0, 0, 11, 10, 0, 0],
'плотва': [19, 22, 13, 11, 20, 11, 18, 23, 25, 18, 25, 14, 12, 17, 10, 18],
'змееголов': [0, 0, 1, 1, 0, 4, 0, 0, 0, 1, 0, 0, 5, 3, 1, 0]})

data_2019_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2019_2.loc[data_2019_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_2.loc[data_2019_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_2.insert(loc=1, column='Year', value=2019)

#------------------------------------------------------------

# общий улов в 2019 году
kapchagay_catch_2019 = pd.concat([data_2019_1, data_2019_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2019 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                         'лещ': [0, 10, 14, 61, 139, 263, 146, 92, 11, 3, 1, 0, 0, 0, 0],
                                         'судак': [7, 72, 132, 54, 49, 24, 15, 4, 2, 1, 0, 0, 0, 0, 0],
                                         'сазан': [0, 5, 17, 34, 19, 28, 21, 8, 7, 1, 0, 0, 0, 0, 0],
                                         'сом': [0, 4, 9, 10, 10, 2, 1, 0, 2, 0, 0, 0, 0, 0, 0],
                                         'жерех': [0, 0, 0, 0, 1, 6, 39, 60, 4, 0, 0, 0, 0, 0, 0],
                                         'беламур': [0, 0, 2, 3, 3, 10, 13, 10, 0, 0, 0, 0, 0, 0, 0],
                                         'толстолоб': [0, 0, 0, 0, 2, 5, 3, 1, 0, 0, 0, 0, 0, 0, 0],
                                         'карась': [0, 0, 4, 26, 14, 13, 13, 6, 2, 0, 0, 0, 0, 0, 0],
                                         'плотва': [0, 0, 199, 246, 227, 71, 21, 1, 0, 0, 0, 0, 0, 0, 0],
                                         'змееголов': [0, 1, 4, 6, 9, 6, 2, 2, 1, 0, 0, 0, 0, 0, 0]})


if __name__ == '__main__':
    print(kapchagay_catch_2019.shape)
    print(kapchagay_catch_2019.columns)
    print(kapchagay_catch_2019[['Date', 'Year']])