import pandas as pd

# === ДАННЫЕ ВОДОЕМА KAPCHAGAY ЗА 2016 ГОД ===

data_2016_1 = pd.DataFrame.from_dict({
                'Date': ['06.04.2016', '08.04.2016', '11.04.2016', '12.04.2016', '14.04.2016', '16.04.2016', '13.05.2016', '15.05.2016', '15.05.2016', '16.05.2016',
                         '16.05.2016', '17.05.2016', '18.05.2016', '19.05.2016', '19.05.2016', '20.05.2016', '21.05.2016', '22.05.2016', '23.05.2016', '23.05.2016',
                         '24.05.2016', '02.06.2016', '02.06.2016', '04.06.2016', '04.06.2016', '05.06.2016', '05.06.2016', '08.06.2016', '08.06.2016', '11.06.2016',
                         '28.07.2016', '29.07.2016', '31.07.2016', '31.07.2016', '02.08.2016', '04.08.2016', '04.08.2016', '05.08.2016', '05.08.2016', '06.08.2016',
                         '08.08.2016', '09.08.2016', '09.08.2016', '10.08.2016', '10.08.2016', '16.09.2016', '16.09.2016', '17.09.2016', '18.09.2016', '18.09.2016',
                         '20.09.2016', '21.09.2016', '22.09.2016', '27.09.2016', '29.09.2016', '29.09.2016', '06.10.2016'],

                'Place': ['Утюги', 'Утюги', 'Утюги', 'Утюги', 'Утюги', 'Подпорная зона', '7 насосная ст.', '9 насосная ст.', '9 насосная ст.', '5 насосная ст.',
                          '5 насосная ст.', '5 насосная ст.', '4 насосная ст.', 'Шенгельд. ост.', 'Шенгельд. ост.', '2 насосная ст.', '3 насосная ст.', 'МВД', 'Каскеленский залив', 'Каскеленский залив',
                          '7 насосная ст.', 'Устья р. Иссык', 'Устья р. Иссык', 'Карачингиль', 'Карачингиль', 'Соленое озера', 'Соленое озера', 'Каракольский залив', 'Каракольский залив', 'Подпорная зона',
                          '9 насосная ст.', '7 насосная ст.', '5 насосная ст.', '5 насосная ст.', '4 насосная ст.', 'Устье р. Балтабай','Устье р. Балтабай', 'Шенгельд. ост.', 'Шенгельд. ост.', 'МВД',
                          'МВД', 'Устье р. Караузяк', 'Устье р. Караузяк', 'Каскеленский залив', 'Каскеленский залив', '9 насосная ст.', '9 насосная ст.', '7 насосная ст.',  '5 насосная ст.', '5 насосная ст.',
                          '2 насосная ст.', '3 насосная ст.', '4 насосная ст.', 'МВД', 'Каскеленский залив', 'Каскеленский залив', 'Подпорная зона'],

                'Instrument': ['Сети 50-90 мм', 'Сети 50-90 мм', 'Сети 50-90 мм', 'Сети 50-90 мм', 'Сети 50-90 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм',
                               'Невод 50 м', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м',
                               'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Невод 50 м', 'Сплав 65-95 мм',
                               'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм',
                               'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м',
                               'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Сети 18-80 мм', 'Невод 50 м', 'Сети 18-80 мм'],
                'Instrument_size':[50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50,
                                   50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50,
                                   50, 50, 50, 50, 50, 50, 50],
                'Area': [
                                    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.4, 0.0,
                                     0.4, 0.0, 0.0, 0.0, 0.4, 0.0, 0.0, 0.0, 0.0, 0.4,
                                     0.0, 0.0, 0.4, 0.0, 0.4, 0.0, 0.4, 0.0, 0.4, 0.0,
                                     0.0, 0.0, 0.0, 0.4, 0.0, 0.0, 0.4, 0.0, 0.4, 0.0,
                                     0.0, 0.0, 0.4, 0.0, 0.4, 0.0, 0.4, 0.0, 0.0, 0.4,
                                     0.0, 0.0, 0.0, 0.0, 0.0, 0.4, 0.0
                        ],
                 'лещ': [11, 6, 6, 6, 12, 0, 86, 12, 11, 17, 5, 30, 56, 46, 2, 18, 15, 17, 258, 0,
                        0, 16, 0, 16, 0, 16, 3, 13, 11, 14, 11, 17, 44, 17, 19, 7, 0, 8, 51, 20,
                        7, 8, 11, 23, 4, 4, 0, 6, 7, 17, 0, 5, 6, 6, 9, 0, 0],
                'судак': [11, 10, 5, 6, 4, 27, 0, 1, 2, 3, 2, 5, 1, 0, 0, 11, 0, 0, 8, 3,
                        0, 10, 0, 9, 4, 7, 0, 7, 0, 0, 10, 9, 10, 5, 0, 7, 1, 9, 6, 14,
                        8, 4, 2, 8, 2, 5, 0, 3, 9, 5, 5, 7, 4, 6, 14, 0, 0],
                'сазан': [1, 0, 0, 0, 0, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 2, 0, 1,
                            0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                'сом':   [5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
                            1, 0, 0, 0, 0, 0, 0, 0, 0, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                'жерех': [2, 1, 0, 1, 0, 0, 4, 4, 0, 0, 3, 1, 0, 0, 0, 1, 0, 0, 0, 1,
                            0, 0, 0, 0, 2, 0, 1, 0, 1, 0, 0, 0, 0, 11, 0, 0, 3, 0, 2, 0,
                            0, 0, 0, 4, 1, 0, 0, 0, 0, 11, 0, 0, 0, 2, 1, 1, 0],
                'б_амур': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 9],
                'т_лоб': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
                'карась':[0, 0, 0, 0, 0, 17, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
                'плотва':[4, 9, 10, 5, 5, 38, 0, 0, 0, 0, 14, 0, 0, 0, 48, 0, 0, 0, 0, 8,
                            0, 0, 24, 0, 15, 0, 3, 0, 45, 0, 0, 0, 0, 84, 0, 92, 9, 0, 71, 0,
                            0, 0, 33, 0, 16, 0, 16, 0, 0, 84, 0, 0, 0, 0, 0, 16, 0],
                'змееголов':[0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 5, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]})

data_2016_1.insert(loc=4, column='CatchType', value='научный')
data_2016_1.loc[data_2016_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_1.loc[data_2016_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_1.insert(loc=1, column='Year', value=2016)

 #промысловый улов

data_2016_2 = pd.DataFrame.from_dict({'Date': ['22.05.2016', '23.05.2016', '24.05.2016', '02.06.2016', '04.06.2016', '05.06.2016', '28.07.2016', '31.07.2016', '02.08.2016', '04.08.2016', '18.09.2016', '27.09.2016',
'29.09.2016', '06.10.2016'],
                                    'Place': ['№11 пром.участок', '№12 пром.участок', '№4 пром.участок', '№16 пром.участок', '№17 пром.участок', '№18 пром.участок', '№2 пром.участок', '№6 пром.участок', '№7 пром.участок', '№16 пром.участок', '№8 пром.участок', '№11 пром.участок',
'№12 пром.участок', '№24 пром.участок'
],
                                    'Instrument': ['Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм',
'Сети 55-100мм', 'Сети 55-100мм'],
                                    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                                    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                                     'лещ': [12, 15, 9, 12, 15, 17, 13, 15, 11, 10, 15, 17, 15, 15],
                                    'судак': [9, 10, 10, 8, 12, 10, 15, 9, 7, 11, 10, 12, 9, 7],
                                    'сазан': [0, 1, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 2, 4],
                                    'сом':   [0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 2],
                                    'жерех': [0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 1, 16],
                                    'б_амур': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
                                    'т_лоб': [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2],
                                    'карась':[0, 0, 0, 0, 0, 5, 0, 0, 2, 0, 0, 0, 6, 5],
                                    'плотва':[11, 9, 11, 13, 15, 10, 15, 12, 12, 15, 15, 13, 18, 15],
                                    'змееголов':[0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 2, 2]})


data_2016_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2016_2.loc[data_2016_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_2.loc[data_2016_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_2.insert(loc=1, column='Year', value=2016)

#------------------------------------------------------------

# общий улов в 2016 году
kapchagay_catch_2016 = pd.concat([data_2016_1, data_2016_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2016 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                         'лещ': [0, 46, 22, 69, 241, 392, 76, 34, 4, 2, 1, 0, 0, 0, 0],
                                         'судак': [5, 46, 100, 68, 8, 7, 17, 5, 2, 0, 0, 0, 0, 0, 0],
                                         'сазан': [0, 5, 0, 3, 9, 2, 2, 2, 2, 2, 3, 1, 0, 0, 0],
                                         'сом': [2, 0, 0, 1, 5, 4, 2, 1, 1, 3, 2, 0, 0, 0, 0],
                                         'жерех': [0, 1, 1, 15, 3, 7, 91, 84, 13, 3, 0, 0, 0, 0, 0],
                                         'б_амур': [0, 7, 3, 0, 0, 0, 1, 2, 3, 2, 1, 1, 0, 0, 0],
                                         'т_лоб': [0, 7, 3, 0, 0, 0, 2, 6, 8, 0, 0, 0, 0, 0, 0],
                                         'карась': [0, 0, 0, 0, 11, 14, 3, 1, 0, 0, 0, 0, 0, 0, 0],
                                         'плотва': [0, 85, 441, 141, 503, 89, 4, 3, 0, 1, 0, 0, 0, 0, 0],
                                         'змееголов': [0, 0, 2, 5, 4, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0]
                                         })


if __name__ == '__main__':
    print(kapchagay_catch_2016.shape)
    print(kapchagay_catch_2016.columns)
    print(kapchagay_catch_2016[['Date', 'Year']])