import pandas as pd

# === ДАННЫЕ ВОДОЕМА KAPCHAGAY ЗА 2018 ГОД ===

data_2018_1 = pd.DataFrame.from_dict({
    'Date': [
        '03.04.2018','06.04.2018','07.04.2018','09.04.2018','28.04.2018','29.04.2018',
        '30.04.2018','30.04.2018','01.05.2018','02.05.2018','02.05.2018','03.05.2018',
        '03.05.2018','05.05.2018','05.05.2018','06.05.2018','06.05.2018','08.05.2018',
        '10.05.2018','11.05.2018','12.05.2018','13.05.2018','13.05.2018','14.05.2018',
        '14.05.2018','13.06.2018','14.06.2018','15.06.2018','16.06.2018','17.06.2018',
        '18.06.2018','19.06.2018','20.06.2018','17.07.2018','17.07.2018','18.07.2018',
        '19.07.2018','20.07.2018','20.07.2018','21.07.2018','22.07.2018','23.07.2018',
        '24.07.2018','25.07.2018','28.07.2018','29.07.2018','31.07.2018','01.08.2018',
        '11.09.2018','12.09.2018','13.09.2018','14.09.2018','15.09.2018','16.09.2018',
        '18.09.2018','20.09.2018','21.09.2018','22.09.2018','23.09.2018','24.09.2018'
    ],
    'Place': [
        'Каракольский залив', 'Каракольский залив', 'Каракольский залив',
        'Каракольский залив', 'Каракольский залив', 'Каракольский залив',
        'Каракольский залив', 'Каракольский залив', 'Каракольский залив',
        '9 насосный станция', '9 насосный станция', '7 насосный станция',
        '5 насосный станция', '5 насосный станция', '1 насосный станция',
        '1 насосный станция', 'Каскеленский залив', 'Каскеленский залив',
        'Устья р. Караузяк', 'Устья р. Караузяк', 'Каскеленский залив',
        'Каскеленский залив', 'Уст. р. Балтабай', 'Уст. р. Тургень',
        'Соленые озера', 'Соленые озера', 'Каракольский залив',
        'Каракольский залив', 'Подпорная зона', 'Подпорная зона',
        'Подпорная зона', 'Подпорная зона', 'Подпорная зона',
        'Подпорная зона', 'Подпорная зона', 'Подпорная зона',
        '9 насосный станция', '9 насосный станция', '9 насосный станция',
        '7 насосный станция', '5 насосный станция', '5 насосный станция',
        '5 насосный станция', '1 насосный станция', 'Каскеленский залив',
        'Устья р. Караузяк', 'Устья р. Исык', 'Уст. р. Тургень',
        'Соленые озера', 'Каракольский залив', 'Караколь разрез',
        'Каракольский залив', 'Соленые озера', 'Уст. р. Балтабай',
        'Устья р. Исык', 'Устья р. Караузяк', 'Каскеленский залив',
        'Зона отдыха МВД', '1 насосный станция', '5 насосный станция'
    ],
    'Instrument': ['Сети 18-100мм'] * 60,

    'Instrument_size': [100] * 60,

    'Area': [
        0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
        0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
        0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
        0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0
    ],

    'лещ': [
        14, 11, 21, 9, 9, 8, 8, 18, 16, 16, 17, 18, 4, 5, 12, 12, 30, 4, 14, 0, 24, 18, 11, 15, 12, 3, 9,
        11, 3, 0, 0, 0, 0, 0, 0, 3, 6, 7, 0, 8, 0, 6, 5, 10, 10, 11, 0, 16, 14, 13, 8, 7, 16, 9, 15, 11, 10, 21, 17, 25
    ],

    'судак': [
        7, 10, 4, 11, 8, 12, 10, 4, 3, 5, 3, 3, 2, 2, 7, 0, 3, 2, 5, 0, 3, 11, 6, 8, 0,
        0, 5, 0, 0, 0, 0, 3, 1, 1, 4, 0, 6, 9, 4, 2, 0, 5, 10, 14, 10, 14, 13, 21, 13,
        10, 0, 7, 8, 4, 8, 2, 7, 3, 6, 4
    ],

    'сазан': [
        0, 2, 0, 3, 0, 0, 5, 4, 3, 3, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 7, 16, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
        0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2, 5, 0, 0, 0, 0, 6, 0, 4, 3, 3, 3, 4, 3, 2, 3, 2
    ],

    'сом': [
        0, 0, 2, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 1, 0, 0, 0, 0, 0,
        0, 1, 1, 0, 0, 0, 0, 0, 0, 3, 2, 0, 0, 0, 2, 0, 4, 6, 3, 3, 3, 3, 2, 1, 2, 2, 3, 3
    ],

    'жерех': [
        1, 1, 0, 0, 1, 0, 0, 2, 1, 0, 0, 0, 0, 3, 0, 0, 32, 2, 0, 0, 0, 0, 1, 0, 0, 1, 11, 1, 3, 1,
        5, 0, 0, 0, 0, 1, 0, 0, 0, 0, 6, 0, 7, 3, 4, 0, 0, 0, 1, 0, 0, 0, 6, 6, 2, 6, 6, 6, 8, 0
    ],

    'б_амур': [
        0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 2, 1, 4, 2, 0, 0, 2, 0, 0, 0, 0, 0,
        0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 2, 2, 1, 0, 0, 1, 0, 0, 0
    ],

    'т_лоб': [
        0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 3, 0, 0, 3, 5, 0, 0,
        1, 0, 0, 0, 0, 0, 0, 0, 3, 1, 1, 2, 1, 0, 0, 0, 0, 0, 0, 0
    ],

    'карась': [
        0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 7, 0, 0, 3, 0, 0, 0, 13,
        0, 6, 8, 6, 4, 3, 0, 2, 0, 0, 0, 0, 0, 3, 0, 0, 0, 7, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
    ],

    'плотва': [
        17, 11, 10, 19, 19, 9, 12, 4, 11, 11, 0, 8, 10, 14, 7, 38, 6, 16, 17, 24, 9, 6, 15, 28, 21, 3, 15, 45, 9, 14,
        6, 3, 2, 5, 1, 0, 8, 0, 3, 7, 12, 7, 35, 28, 20, 31, 10, 7, 9, 7, 3, 14, 10, 12, 17, 16, 9, 0, 12, 14
    ]
})

data_2018_1.insert(loc=4, column='CatchType', value='научный')
data_2018_1.loc[data_2018_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_1.loc[data_2018_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_1.insert(loc=1, column='Year', value=2018)

#промысловый улов
data_2018_2 = pd.DataFrame.from_dict({

    'Date': [
        '19.07.2018', '20.07.2018', '22.07.2018', '23.07.2018', '24.07.2018',
        '25.07.2018', '28.07.2018', '31.07.2018', '18.09.2018', '21.09.2018',
        '24.09.2018', '21.09.2018', '24.09.2018', '24.09.2018'
    ],

    'Place': [
        '№24 пром.участок', '№23 пром.участок', '№4 пром.участок', '№5 пром.участок',
        '№6 пром.участок', '№8 пром.участок', '№12 пром.участок', '№16 пром.участок',
        '№17 пром.участок', '№18 пром.участок', '№21 пром.участок', '№11 пром.участок',
        '№6 пром.участок', '№24 пром.участок'
    ],

    'Instrument': ['Сети 55-100мм'] * 14,

    'Instrument_size': [100] * 14,

    'Area': [0.0] * 14,

    'лещ': [8, 13, 15, 11, 12, 16, 14, 11, 15, 18, 20, 17, 9, 19],

    'судак': [10, 15, 12, 8, 15, 11, 10, 12, 9, 11, 15, 12, 13, 16],

    'сазан': [5, 2, 0, 0, 0, 2, 1, 0, 1, 3, 0, 0, 5, 2],

    'сом': [0, 2, 0, 0, 0, 5, 0, 1, 3, 1, 0, 1, 2, 0],

    'жерех': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 11, 0],

    'б_амур': [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],

    'т_лоб': [0, 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 1, 0],

    'карась': [0, 0, 3, 0, 2, 0, 5, 0, 3, 0, 5, 0, 0, 7],

    'плотва': [13, 18, 15, 10, 9, 12, 11, 18, 14, 16, 10, 13, 8, 11],

    'змееголов': [0, 1, 0, 0, 0, 0, 2, 1, 0, 1, 0, 0, 0, 2]
})

data_2018_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2018_2.loc[data_2018_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_2.loc[data_2018_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_2.insert(loc=1, column='Year', value=2018)

#------------------------------------------------------------

# общий улов в 2018 году
kapchagay_catch_2018 = pd.concat([data_2018_1, data_2018_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2018 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                         'лещ': [0, 15, 26, 52, 213, 179, 47, 22, 4, 0, 0, 0, 0, 0, 0],
                                         'судак': [4, 31, 77, 94, 48, 38, 47, 15, 1, 3, 0, 0, 0, 0, 0],
                                         'сазан': [2, 18, 12, 22, 25, 14, 13, 8, 1, 0, 0, 0, 0, 0, 0],
                                         'сом': [0, 2, 3, 4, 7, 6, 12, 5, 2, 4, 6, 3, 0, 0, 0],
                                         'жерех': [0, 0, 4, 27, 19, 24, 32, 13, 8, 0, 0, 0, 0, 0, 0],
                                         'б_амур': [0, 1, 7, 18, 3, 4, 8, 0, 2, 0, 0, 0, 0, 0, 0],
                                         'т_лоб': [0, 0, 3, 0, 0, 3, 2, 9, 6, 2, 0, 0, 0, 0, 0],
                                         'карась': [0, 19, 12, 12, 14, 9, 6, 2, 0, 0, 0, 0, 0, 0, 0],
                                         'плотва': [0, 64, 145, 157, 152, 85, 20, 5, 1, 0, 0, 0, 0, 0, 0],
                                         'змееголов': [0, 13, 8, 4, 3, 6, 5, 3, 1, 0, 0, 0, 0, 0, 0]})

if __name__ == '__main__':
    print(kapchagay_catch_2018.shape)
    print(kapchagay_catch_2018.columns)
    print(kapchagay_catch_2018[['Date', 'Year']])