import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА Капшагай ЗА 2015 ГОД
# ============================================================

# Научно-исследовательский улов
data_2015_1 = pd.DataFrame.from_dict({
            'Date': ['25.03.2015','26.03.2015','27.03.2015',
                                                              '02.04.2015','03.04.2015','18.05.2015',
                                                              '18.05.2015','20.05.2015','20.05.2015',
                                                              '22.05.2015','24.05.2015','24.05.2015',
                                                              '25.05.2015','27.05.2015','28.05.2015',
                                                              '28.05.2015','29.05.2015','12.06.2015',
                                                              '12.06.2015','13.06.2015','13.06.2015',
                                                              '16.06.2015','18.06.2015','19.06.2015',
                                                              '20.06.2015','22.06.2015','22.06.2015',
                                                              '23.06.2015','23.06.2015','25.06.2015',
                                                              '10.08.2015','10.08.2015','11.08.2015',
                                                              '12.08.2015','13.08.2015','13.08.2015',
                                                              '17.08.2015','18.08.2015','19.08.2015',
                                                              '20.08.2015','20.08.2015','21.08.2015',
                                                              '23.08.2015','24.08.2015','25.08.2015',
                                                              '27.08.2015','28.08.2015','29.08.2015',
                                                              '30.08.2015'],
            'Place': ['Утюги','Утюги','Каракольский залив', 'Каракольский залив','Каракольский залив','каракольский залив',
                  'каракольский залив','соленые озера','соленые озера', 'соленые озера','устье р Тургень','карачингиль',
                  'устье р Тургень','устье р Караузяк','устье р Каскелен', 'Каскеленский залив','устье р Каскелен','МВД',
                  'МВД','1 насосная','1 насосная', '1 насосная','2 насосная','3 насосная', '4 насосная','5 насосная','5 насосная',
                  '9 насосная','9 насосная','9 насосная', 'МВД','1 насосная','1 насосная', 'Каскеленский залив','устье р Караузяк',
                      'устье р Караузяк','2 насосная','3 насосная','4 насосная', '5 насосная','5 насосная','ст 7А',
                  'Устье р Иссык','Устье р Тургень','ст 8А', 'соленые оз','соленые оз','каракольский залив', 'каракольский залив'],
            'Instrument': ['Сети 50-90 мм','Сети 50-90 мм','Сети 50-90 мм', 'Сети 50-90 мм','Сети 50-90 мм','Сети 18-80 мм',
                           'Невод 50 м','Сети 18-80 мм','Невод 50 м', 'Сети 18-80 мм','Сети 18-80 мм','Невод 50 м',
                           'Сети 18-80 мм','Сети 18-80 мм','Сети 18-80 мм', 'Невод 50 м','Сети 18-80 мм','Сети 18-80 мм',
                           'Невод 50 м','Сети 18-80 мм','Невод 50 м', 'Сети 18-80 мм','Сети 18-80 мм','Сети 18-80 мм',
                           'Сети 18-80 мм','Сети 18-80 мм','Невод 50 м', 'Сети 18-80 мм','Невод 50 м','Сети 18-80 мм',
                           'Сети 18-80 мм','Невод 50 м','Сети 18-80 мм', 'Сети 18-80 мм','Сети 18-80 мм','Невод 50 м',
                           'Сети 18-80 мм','Сети 18-80 мм','Сети 18-80 мм', 'Сети 18-80 мм','Невод 50 м','Сети 18-80 мм',
                           'Сети 18-80 мм','Сети 18-80 мм','Сети 18-80 мм', 'Сети 18-80мм','Невод 50 м','Невод 50 м',
                           'Сети 18-80мм'],
            'Instrument_size': [50, 50, 50, 50, 50, 50,  200, 50, 200, 50, 50, 200, 50, 50, 50, 200, 50, 50, 200, 50, 200,
                                50, 50, 50, 50, 50, 200, 50, 200, 50,  50, 200, 50, 50, 50, 200, 50, 50, 50, 50, 200, 50,
                                50, 50, 50, 50, 200, 200, 50],
                        'Area': [0.0, 0.0,  0.0,  0.0,  0.0,  4.2,  4.2, 0.0, 4.2, 0.0,   0.0,  4.2, 0.0,  0.0,  0.0,  4.2, 0.0,  0.0,  4.2, 0.0, 4.2,
                                 0.0, 0.0,  0.0,  0.0,  0.0,  4.2,  0.0,  4.2, 0.0,   0.0, 4.2,  0.0, 0.0,  0.0,  4.2,  0.0,  0.0,  0.0,  0.0, 4.2,  0.0,
                                 0.0, 0.0, 0.0,  0.0, 4.2, 4.2, 0.0],
            'лещ': [28, 34, 17, 0, 0, 44, 11, 26, 3, 33,
                    36, 0, 16, 50, 41, 0, 39, 1, 0, 0,
                    2, 12, 8, 8, 13, 26, 5, 17, 11, 22,
                    15, 51, 13, 40, 16, 11, 19, 12, 5, 21,
                    17, 5, 19, 22, 16, 5, 0, 0, 7],
            'судак': [36, 24, 3, 5, 2, 6, 2, 4, 0, 2, 5, 4, 1, 0, 12, 3, 14, 2, 0, 2, 0, 7, 7, 6, 7, 4, 2, 7, 0, 13, 2, 6, 3, 7, 5, 2, 29, 11, 11, 18, 5, 6, 7, 7, 11, 0, 1, 0, 5],
            'сазан': [0, 9, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 2, 1, 0, 0, 0, 0, 0, 4, 1, 0, 0, 0, 0],
            'сом': [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            'жерех': [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2, 3, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 4, 4, 11, 0, 9, 6, 0, 0, 3, 1, 0],
            'б_амур': [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            'т_лоб': [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            'карась': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 5, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 2, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0],
            'плотва': [0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 2, 15, 2, 0, 0, 8, 0, 3, 24, 3, 38, 96, 2, 69, 112, 3, 14, 0, 45, 56, 3, 71, 50, 26, 0, 33, 11, 17, 13, 7, 84, 6, 8, 5, 7, 39, 9, 16, 98],
            'змееголов': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]})

#print("Длина Date:", len(data_2015_1['Date']))
#print("Длина Place:", len(data_2015_1['Place']))
#print("Длина Instrument:", len(data_2015_1['Instrument']))
#print("Длина Instrument_size:", len(data_2015_1['Instrument_size']))
#print("Длина Area:", len(data_2015_1['Area']))
#print("Длина судак:", len(data_2015_1['судак']))
#print("Длина сазан:", len(data_2015_1['сазан']))
#print("Длина сом:", len(data_2015_1['сом']))
#print("Длина жерех:", len(data_2015_1['жерех']))
#print("Длина беламур:", len(data_2015_1['беламур']))
#print("Длина толстолоб:", len(data_2015_1['толстолоб']))
#print("Длина карась:", len(data_2015_1['карась']))
#print("Длина плотва:", len(data_2015_1['плотва']))
#print("Длина змееголов:", len(data_2015_1['змееголов']))

#df = pd.DataFrame(data_2015_1)

data_2015_1.insert(loc=4, column='CatchType', value='научный')
data_2015_1.loc[data_2015_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_1.loc[data_2015_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_1.insert(loc=1, column='Year', value=2015)

 #промысловый улов

data_2015_2 = pd.DataFrame.from_dict({
    'Date':      ['22.06.2015','23.06.2015','11.08.2015', '12.08.2015','15.08.2015','18.08.2015', '21.08.2015','28.08.2015','29.08.2015'],
    'Place': ['№24 пром.участок','№22 пром.участок','№18 пром.участок',
              '№6 пром.участок','№3 пром.участок','№8 пром.участок',
              '№12 пром.участок','№23 пром.участок','№24 пром.участок'],
    'Instrument': ['Сети 55-100мм','Сети 55-100мм','Сети 55-100мм',
                   'Сети 55-100мм','Сети 55-100мм','Сети 55-100мм',
                   'Сети 55-100мм','Сети 55-100мм','Сети 55-100мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [12, 9, 7, 10, 12, 15, 12, 10, 14],
    'судак': [13, 6, 10, 9, 10, 11, 9, 12, 15],
    'сазан': [1, 0, 2, 0, 0, 1, 2, 2, 3],
    'сом': [0, 0, 1, 0, 0, 0, 1, 1, 0],
    'жерех': [0, 0, 0, 0, 0, 0, 0, 0, 3],
    'б_амур': [0,0,1,0,0,0,0,0,0],
    'т_лоб': [0,0,0,0,0,0,1,0,0],
    'карась': [3, 0, 0, 0, 0, 3, 0, 5, 3],
    'плотва': [15, 11, 8, 11, 15, 12, 9, 12, 7],
    'змееголов': [0, 0, 0, 0, 0, 0, 1, 0, 1],})

data_2015_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2015_2.loc[data_2015_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_2.loc[data_2015_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_2.insert(loc=1, column='Year', value=2015)

#------------------------------------------------------------

# общий улов в 2015 году
kapchagay_catch_2015 = pd.concat([data_2015_1, data_2015_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2015 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                         'лещ': [0, 33, 17, 30, 110, 139, 192, 96, 32, 4, 3, 1, 0, 0, 0],
                                         'судак': [8, 88, 75, 50, 23, 25, 22, 7, 6, 4, 1, 0, 0, 0, 0],
                                         'сазан': [0, 1, 2, 1, 4, 3, 4, 11, 3, 5, 4, 1, 0, 0, 0],
                                         'сом': [0, 0, 2, 0, 4, 3, 6, 5, 5, 4, 1, 0, 0, 0, 0],
                                         'жерех': [0, 1, 4, 4, 23, 14, 37, 59, 11, 0, 0, 0, 0, 0, 0],
                                         'б_амур': [0, 0, 0, 0, 0, 0, 1, 2, 3, 2, 1, 1, 0, 0, 0],
                                         'т_лоб': [0, 0, 0, 0, 0, 0, 2, 9, 9, 0, 0, 0, 0, 0, 0],
                                         'карась': [0, 0, 0, 0, 4, 9, 8, 3, 0, 0, 0, 0, 0, 0, 0],
                                         'плотва': [0, 37, 210, 58, 64, 54, 14, 5, 2, 1, 1, 0, 0, 0, 0],
                                         'змееголов': [0, 0, 0, 4, 3, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0]})



if __name__ == '__main__':
    print(kapchagay_catch_2015.shape)
    print(kapchagay_catch_2015.columns)
    print(kapchagay_catch_2015[['Date', 'Year']])