import pandas as pd

# === ДАННЫЕ ВОДОЕМА KAPCHAGAY ЗА 2017 ГОД ===

data_2017_1 = pd.DataFrame.from_dict({
                'Date': ['08.04.2017', '10.04.2017', '12.04.2017', '14.04.2017', '15.04.2017', '17.04.2017', '18.04.2017', '14.05.2017', '14.05.2017', '15.05.2017', '16.05.2017', '16.05.2017',
                        '18.05.2017', '20.05.2017', '20.05.2017', '21.05.2017', '21.05.2017', '22.05.2017', '23.05.2017', '25.05.2017', '27.05.2017', '30.05.2017', '18.07.2017', '18.07.2017',
                        '19.07.2017', '20.07.2017', '21.07.2017', '24.07.2017', '24.07.2017', '26.07.2017', '27.07.2017', '29.07.2017', '29.07.2017', '30.07.2017', '02.08.2017', '13.09.2017',
                        '14.09.2017', '14.09.2017', '16.09.2017', '17.09.2017', '19.09.2017', '21.09.2017', '21.09.2017', '22.09.2017', '24.09.2017', '24.09.2017', '25.09.2017', '27.09.2017',
                        '28.09.2017', '28.09.2017', '01.10.2017', '02.10.2017', '04.10.2017', '06.10.2017', '07.10.2017'],
                 'Place':['каракольский залив', 'каракольский залив', 'соленые озера', 'соленые озера', 'соленые озера', 'каракольский залив', 'каракольский залив', '9 насосная', '9 насосная', '7 насосная', '5 насосная', '5 насосная',
                        '1 насосная', 'МВД', 'МВД', 'Каскеленский залив', 'Каскеленский залив', 'устье р Караузяк', 'Середина разрез', 'устье р Иссык', 'Карачингиль', 'каракольский залив', '9 насосная', '9 насосная',
                        'соленые оз', '7 насосн. Ст', '5 насосн ст', '1 насосной ст', '1 насосной ст', 'устья р.Есик', '2 насосной ст', '3 насосной ст', '3 насосной ст', 'МВД', 'Каскеленский зал.', 'каракольский залив',
                        '9 насосная', '9 насосная', 'устья р.Тургень', 'устья р.Есик', 'устья р.Караузяк', 'каскелен залив', 'каскелен залив', 'МВД', '1 насосной ст', '1 насосной ст', '2 насосной ст', 'Середина разрез',
                        '5 насосн ст', '5 насосн ст', 'Подпорная зона', 'Подпорная зона', 'Подпорная зона', 'Подпорная зона', 'Подпорная зона'],
                'Instrument': ['Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м',
                                'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м',
                                'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм',
                                'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм',
                                'Сети 20-100мм', 'Невод 50 м', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм', 'Сети 20-100мм'],

                'Instrument_size': [50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50,
                                    50, 50, 200, 50, 50, 50, 50, 50, 50, 50, 50, 50,
                                    50, 50, 50, 50, 200, 50, 50, 50, 200, 50, 50, 50,
                                    50, 50, 50, 50, 50, 50, 200, 50, 50, 50, 50, 50,
                                    50, 50, 50, 50, 50, 50, 50],

                'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.4, 0.0, 0.0, 0.4,
                         0.0, 0.0, 0.4, 0.0, 0.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.4,
                         0.0, 0.0, 0.0, 0.0, 0.4, 0.0, 0.0, 0.0, 0.4, 0.0, 0.0, 0.0,
                         0.0, 0.4, 0.0, 0.0, 0.0, 0.0, 0.4, 0.0, 0.0, 0.4, 0.0, 0.0,
                         0.0, 0.4, 0.0, 0.0, 0.0, 0.0, 0.0],
                'лещ': [24, 20, 20, 8, 21, 17, 3, 1, 11, 12, 64, 3, 19, 19, 0, 60, 0, 56, 20, 64,
                        71, 9, 24, 14, 10, 10, 14, 8, 5, 18, 12, 9, 12, 7, 27, 9, 12, 5, 0, 5,
                        9, 9, 3, 4, 11, 5, 11, 4, 19, 2, 21, 29, 35, 20, 27],
                'судак': [3, 1, 10, 7, 16, 23, 0, 0, 2, 4, 9, 0, 0, 12, 4, 20, 3, 4, 4, 1,
                            2, 2, 21, 1, 12, 4, 7, 7, 6, 14, 10, 11, 7, 4, 12, 17, 14, 2, 15, 43,
                            16, 31, 4, 15, 19, 7, 7, 12, 12, 4, 0, 0, 0, 0, 0],
                'сазан': [1, 0, 2, 2, 2, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 7, 0, 6, 0, 0,
                        0, 4, 0, 0, 0, 1, 0, 2, 0, 6, 0, 1, 0, 0, 5, 0, 1, 0, 10, 0,
                        2, 3, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
                'сом': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 2, 3,
                        0, 7, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0,
                        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 5, 0, 1],
                'жерех': [0, 1, 0, 0, 2, 4, 0, 0, 0, 2, 0, 1, 0, 0, 2, 5, 1, 0, 0, 2,
                        5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 4, 0, 0, 14, 0, 3, 1, 0,
                        4, 0, 0, 3, 4, 0, 0, 2, 2, 0, 0, 21, 0, 27, 0],
                'б_амур': [0, 0, 2, 1, 2, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 0, 15, 16, 14],
                'т_лоб': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
                            2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 5, 10, 3, 3],
                'карась': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0,
                            0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 7,
                            0, 5, 0, 0, 0, 0, 0, 0, 4, 0, 18, 0, 14, 23, 5],
                'плотва': [39, 46, 18, 18, 23, 9, 0, 12, 0, 38, 50, 3, 28, 22, 15, 12, 8, 0, 0, 12,
                            9, 1, 30, 26, 15, 17, 31, 14, 31, 24, 21, 17, 24, 12, 12, 0, 12, 14, 6, 0,
                            12, 4, 10, 9, 12, 18, 9, 9, 12, 13, 25, 52, 0, 26, 32],
             'змееголов': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
                            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 2,
                            0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 5, 0, 3]})

data_2017_1.insert(loc=4, column='CatchType', value='научный')
data_2017_1.loc[data_2017_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_1.loc[data_2017_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_1.insert(loc=1, column='Year', value=2017)

#промысловый улов

data_2017_2 = pd.DataFrame.from_dict({
                'Date': ['21.05.2017', '22.05.2017', '23.05.2017', '25.05.2017', '27.05.2017', '30.05.2017', '18.07.2017', '20.07.2017', '21.07.2017', '24.07.2017', '13.09.2017', '14.09.2017',
                        '16.09.2017', '17.09.2017', '19.09.2017', '21.09.2017', '24.09.2017', '25.09.2017', '06.10.2017', '07.10.2017'],
                'Place': ['№12 пром.участок', '№11 пром.участок', '№16 пром.участок', '№17 пром.участок', '№18 пром.участок', '№22 пром.участок', '№3 пром.участок', '№4 пром.участок', '№6 пром.участок', '№8 пром.участок', '№24 пром.участок', '№4 пром.участок',
                            '№18 пром.участок', '№17 пром.участок', '№16 пром.участок', '№12 пром.участок', '№11 пром.участок', '№8 пром.участок', '№24 пром.участок', '№23 пром.участок'],
                'Instrument': ['Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм',
                                'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм', 'Сети 55-100мм'],
                 'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
                'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'лещ': [12, 9, 11, 12, 9, 0, 13, 15, 12, 9, 15, 11, 10, 12, 15, 10, 14, 15, 16, 13],
                                    'судак': [8, 8, 10, 9, 11, 13, 10, 9, 7, 11, 10, 13, 7, 15, 10, 9, 12, 10, 8, 10],
                                    'сазан': [3, 0, 1, 0, 1, 2, 0, 0, 0, 0, 3, 0, 2, 0, 1, 0, 0, 0, 2, 1],
                                    'сом':   [1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0],
                                    'жерех': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 16, 19],
                                    'б_амур': [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 2, 3],
                                    'т_лоб': [0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2, 0],
                                    'карась':[5, 0, 1, 0, 0, 4, 0, 0, 0, 0, 7, 0, 3, 4, 0, 0, 0, 0, 0, 3],
                                    'плотва':[10, 10, 0, 12, 9, 15, 15, 11, 19, 13, 14, 14, 8, 11, 14, 15, 15, 13, 9, 8],
                                    'змееголов':[1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1]})

data_2017_2.insert(loc = 4, column='CatchType', value='промысловый')
data_2017_2.loc[data_2017_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_2.loc[data_2017_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_2.insert(loc=1, column='Year', value=2017)

#------------------------------------------------------------

# общий улов в 2017 году
kapchagay_catch_2017 = pd.concat([data_2017_1, data_2017_2], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке по возрастам
qty_treated_fish_2017 = pd.DataFrame.from_dict({
                'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9',
                            'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
                                         'лещ': [0, 21, 41, 46, 48, 209, 150, 140, 27, 8, 3, 0, 0, 0, 0 ],
                                         'судак': [0, 88, 183, 43, 25, 11, 10, 19, 17, 2, 1, 0, 0, 0, 0],
                                         'сазан': [2, 9, 12, 21, 16, 5, 2, 2, 1, 1, 1, 0, 0, 0, 0],
                                         'сом': [0, 7, 5, 4, 5, 3, 2, 2, 2, 1, 2, 0, 0, 0, 0],
                                         'жерех': [0, 0, 1, 11, 24, 36, 52, 45, 14, 2, 3, 0, 0, 0, 0],
                                         'б_амур': [0, 5, 2, 1, 0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0],
                                         'т_лоб': [0, 6, 4, 1, 0, 0, 0, 2, 3, 2, 1, 0, 0, 0, 0],
                                         'карась': [0, 0, 8, 5, 4, 5, 2, 1, 2, 0, 0, 0, 0, 0, 0],
                                         'плотва': [0, 16, 104, 48, 143, 47, 20, 4, 0, 0, 0, 0, 0, 0, 0],
                                         'змееголов': [0, 1, 4, 3, 0, 1, 3, 0, 1, 0, 0, 0, 0, 0, 0]
                                         })


if __name__ == '__main__':
    print(kapchagay_catch_2017.shape)
    print(kapchagay_catch_2017.columns)
    print(kapchagay_catch_2017[['Date', 'Year']])