import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2021 ГОД
# ============================================================

data_2021_1 = pd.DataFrame.from_dict({
    'Date': ['10.05.2021', '11.05.2021', '12.05.2021', '15.05.2021', '16.05.2021', '17.05.2021', '18.05.2021', '11.07.2021', '13.07.2021',
             '14.07.2021', '17.07.2021', '19.07.2021', '21.07.2021', '22.07.2021', '17.09.2021', '18.09.2021', '19.09.2021'],
    'Place': ['Коржун', 'Бархот', 'Аманат', 'м. Тополев', 'Карсакбай', 'Ултарак', 'м.Волчий', 'Коржун', 'Бархот', 'Аманат',
              'м.Топалев', 'Карсакбай', 'м. Ултарак', 'м.Волчий', 'Коржун', 'Бархот', 'Аманат'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод',
                   'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4],
    'лещ': [27, 27, 15, 15, 19, 9, 25, 34, 13, 7, 16, 15, 16, 16, 337, 60, 186],
    'судак': [0, 2, 1, 0, 0, 0, 2, 1, 5, 2, 7, 12, 9, 4, 11, 2, 0],
    'окунь': [15, 30, 15, 22, 16, 12, 0, 11, 14, 21, 17, 15, 24, 23, 9, 9, 0],
    'плотва': [23, 10, 8, 0, 0, 0, 0, 6, 21, 16, 13, 32, 22, 12, 55, 28, 2],
    'щука': [1, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 5, 2, 3, 2, 0, 0],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0],
    'карась': [0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 6],
    'ерш': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2],
    'налим': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
    'линь': [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 3, 3, 0, 1, 2]
})
data_2021_1.insert(loc = 4, column='CatchType', value='научный')
data_2021_1.loc[data_2021_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_1.loc[data_2021_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_1.insert(loc=1, column='Year', value=2021)

data_2021_2 = pd.DataFrame.from_dict({
    'Date': ['15.05.2021', '15.05.2021', '16.05.2021', '16.05.2021', '17.05.2021', '17.05.2021', '18.05.2021', '18.05.2021',
             '17.07.2021', '17.07.2021', '19.07.2021', '19.07.2021', '21.07.2021', '21.07.2021', '22.07.2021', '22.07.2021'],
    'Place': ['Тополев м.', 'Тополев м.', 'Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак', 'м.Волчий', 'м.Волчий', 'Тополев м.',
              'Тополев м.', 'Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак', 'м.Волчий', 'м.Волчий'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [7, 6, 16, 10, 22, 28, 13, 12, 7, 4, 2, 2, 4, 2, 0, 0],
    'судак': [2, 2, 0, 3, 3, 1, 0, 3, 2, 4, 3, 2, 4, 1, 4, 1],
    'окунь': [19, 13, 14, 20, 14, 11, 9, 19, 18, 15, 13, 10, 13, 6, 15, 4],
    'плотва': [16, 10, 19, 17, 22, 8, 7, 8, 23, 29, 22, 22, 37, 24, 29, 29],
    'щука': [0, 0, 2, 0, 3, 5, 5, 5, 3, 2, 3, 2, 3, 1, 2, 1],
    'сазан': [0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'карась': [2, 2, 5, 5, 2, 3, 2, 4, 0, 0, 1, 0, 0, 0, 1, 0],
      'линь': [0, 0, 2, 0, 2, 0, 0, 3, 0, 0, 1, 1, 1, 0, 1, 2]
})
data_2021_2.insert(loc = 4, column='CatchType', value='научный')
data_2021_2.loc[data_2021_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_2.loc[data_2021_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_2.insert(loc=1, column='Year', value=2021)

data_2021_3 = pd.DataFrame.from_dict({
    'Date': ['10.05.2021', '10.05.2021', '11.05.2021', '11.05.2021', '12.05.2021', '12.05.2021', '13.05.2021', '13.05.2021', '11.07.2021', '11.07.2021',
             '13.07.2021', '13.07.2021', '14.07.2021', '14.07.2021', '16.07.2021', '16.07.2021', '17.09.2021', '18.09.2021', '19.09.2021'],
    'Place': ['Коржун', 'Коржун', 'Бархот', 'Бархот', 'Аманат', 'Аманат', 'р. Кара Ертис', 'р. Кара Ертис', 'Коржун', 'Коржун', 'Бархот',
              'Бархот', 'Аманат', 'Аманат', 'р. Кара Ертис', 'р. Кара Ертис', 'Коржун', 'Бархот', 'Аманат'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [7, 11, 14, 12, 13, 9, 11, 14, 31, 27, 7, 3, 17, 9, 14, 8, 10, 15, 21],
    'судак': [0, 2, 0, 2, 0, 2, 0, 0, 2, 1, 2, 2, 2, 3, 3, 2, 16, 2, 6],
    'окунь': [34, 33, 45, 27, 30, 39, 14, 6, 25, 19, 13, 14, 9, 14, 13, 23, 20, 3, 7],
    'плотва': [28, 36, 55, 47, 28, 68, 17, 11, 42, 29, 31, 23, 27, 23, 27, 19, 126, 61, 0],
    'щука': [1, 2, 1, 0, 1, 0, 3, 2, 2, 1, 3, 0, 3, 0, 2, 2, 0, 0, 0],
    'сазан': [0, 0, 0, 0, 0, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 0, 0],
    'карась': [7, 8, 2, 3, 3, 0, 14, 11, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1],
    'ерш': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 7],
    'линь': [0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 2, 2, 1, 0, 0],
    'налим': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
})
data_2021_3.insert(loc = 4, column='CatchType', value='научный')
data_2021_3.loc[data_2021_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_3.loc[data_2021_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_3.insert(loc=1, column='Year', value=2021)

data_2021_4 = pd.DataFrame.from_dict({
    'Date': ['30.03.2021', '16.07.2021', '16.07.2021', '17.07.2021', '20.09.2021', '20.09.2021'],
    'Place': ['Причал', 'Тополев м.', 'Тополев м.', 'Тополев м.', 'Тополев м.', 'Тополев м.'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [400, 600, 400, 400, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [1029, 514, 687, 292, 3436, 5154],
    'судак': [18, 60, 36, 48, 338, 406],
    'окунь': [28, 5, 0, 0, 57, 68],
    'плотва': [0, 0, 93, 93, 187, 140],
    'щука': [8, 0, 0, 0, 20, 16],
    'язь': [0, 27, 0, 0, 5, 3],
    'карась': [0, 0, 0, 0, 12, 10]
})
data_2021_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2021_4.loc[data_2021_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_4.loc[data_2021_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_4.insert(loc=1, column='Year', value=2021)

data_2021_5 = pd.DataFrame.from_dict({
    'Date': ['29.03.2021', '12.07.2021', '13.07.2021', '14.07.2021', '19.09.2021', '19.09.2021', '19.09.2021'],
    'Place': ['Аманат', 'Аксуат', 'Бархот', 'Аманат', 'Аманат', 'Аманат', 'Аманат'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [600, 400, 400, 600, 600, 500, 600],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [1029, 257, 343, 945, 1718, 171, 1718],
    'судак': [96, 42, 48, 36, 360, 24, 360],
    'окунь': [285, 28, 57, 0, 57, 57, 171],
    'плотва': [467, 0, 0, 28, 47, 93, 93],
    'щука': [24, 2, 4, 2, 4, 2, 58],
    'карась': [0, 0, 0, 1, 0, 0, 5]
})
data_2021_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2021_5.loc[data_2021_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_5.loc[data_2021_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_5.insert(loc=1, column='Year', value=2021)

data_2021_6 = pd.DataFrame.from_dict({
    'Date': ['30.03.2021', '30.03.2021', '31.03.2021', '31.03.2021'],
    'Place': ['Байтогас', 'Байтогас', 'Ултарак', 'Ултарак'],
    'Instrument': ['сети 50-55 мм', 'сети 50-55 мм', 'сети 50-55 мм', 'сети 55 мм'],
    'Instrument_size': [50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0],
    'лещ': [442, 428, 94, 93],
    'судак': [88, 78, 22, 21],
    'окунь': [18, 21, 40, 25],
    'плотва': [0, 0, 0, 0],
    'щука': [10, 8, 11, 8]
})
data_2021_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2021_6.loc[data_2021_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_6.loc[data_2021_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_6.insert(loc=1, column='Year', value=2021)

data_2021_7 = pd.DataFrame.from_dict({
    'Date': ['28.03.2021', '28.03.2021', '28.03.2021', '28.03.2021', '11.07.2021', '12.07.2021', '12.07.2021'],
    'Place': ['Аксуат', 'Аксуат', 'Жолнускау', 'Жолнускау', 'Аксуат', 'Аксуат', 'Аксуат'],
    'Instrument': ['сети 50 мм', 'сети 50 мм', 'сети 55 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 55, 50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [114, 98, 87, 100, 14, 21, 42],
    'судак': [41, 49, 22, 35, 1, 5, 20],
    'окунь': [48, 64, 38, 40, 3, 3, 12],
    'плотва': [0, 30, 0, 24, 0, 0, 10],
    'щука': [9, 8, 11, 7, 2, 2, 2],
    'карась': [0, 0, 0, 0, 0, 0, 4],
})
data_2021_7.insert(loc = 4, column='CatchType', value='промысловый')
data_2021_7.loc[data_2021_7['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2021_7.loc[data_2021_7['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2021_7.insert(loc=1, column='Year', value=2021)

# общий улов в 2021 году
zhaysan_catch_2021 = pd.concat([data_2021_1, data_2021_2, data_2021_3, data_2021_4, data_2021_5, data_2021_6, data_2021_7], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2021 году
qty_treated_fish_2021 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ': [0, 0, 98, 61, 40, 30, 64, 59, 52, 68, 15, 9, 19, 35, 0],
         'судак': [4, 26, 137, 50, 20, 9, 2, 2, 2, 0, 0, 0, 0, 0, 0],
         'окунь': [0, 50, 146, 115, 135, 43, 14, 6, 0, 0, 0, 0, 0, 0, 0],
         'плотва': [0, 61, 216, 76, 50, 16, 6, 0, 0, 0, 0, 0, 0, 0, 0],
         'щука': [0, 0, 18, 46, 17, 24, 18, 0, 0, 0, 0, 0, 0, 0, 0],
         'сазан': [0, 0, 0, 0, 0, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0],
         'язь': [0, 0, 0, 7, 6, 6, 3, 0, 0, 0, 0, 0, 0, 0, 0],
         'карась': [0, 0, 0, 0, 0, 0, 8, 10, 19, 16, 15, 15, 0, 0, 0],
         'линь': [0, 0, 0, 3, 10, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})


