import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2019 ГОД
# ============================================================

# Научно-исследовательский неводный улов
data_2019_1 = pd.DataFrame.from_dict({
    'Date': ['25.04.2019', '26.04.2019', '27.04.2019', '28.04.2019', '30.04.2019', '01.05.2019', '03.05.2019', '03.07.2019', '04.07.2019',
             '05.07.2019', '06.07.2019', '09.07.2019', '10.07.2019', '11.07.2019'],
    'Place': ['Коржун', 'Бархот', 'Аманат', 'Шенгельды', 'м. Тополев', 'Карсакбай', 'Ултарак', 'Коржун', 'м. Бархот', 'Аманат', 'Шенгельды',
              'Причал', 'Карсакбай', 'м. Ултарак'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2],
    'лещ':   [12,  0, 78,  9, 25,  4,  5,   9, 197, 28, 83,  7,  2, 95],
    'судак': [0,  5,  0,  2,  0,  0,  0,   1,  24,  1,  5,  2,  0, 16],
    'окунь': [0,  0,  0,  0,  0,  0,  0,   6,   1,  6, 46,  0,  0,  9],
    'плотва':[45, 14,  0,  8,  9,  0,  0,   2,   1,  0,  0,  0,  0, 14],
    'щука':  [5,  0,  0, 10,  0,  5,  4,   0,   2,  0,  0,  0,  0,  0],
    'язь':   [0,  0,  0,  0,  0,  0,  0,   0,   0,  0,  0,  0,  0,  0],
    'карась':[0,  0,  0,  0,  0,  0,  0,   0,   0,  0,  0,  0,  0,  0]
})
data_2019_1.insert(loc=4, column='CatchType', value='научный')
data_2019_1.loc[data_2019_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_1.loc[data_2019_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_1.insert(loc=1, column='Year', value=2019)

data_2019_2 = pd.DataFrame.from_dict({
    'Date': ['01.05.2019', '01.05.2019', '02.05.2019', '02.05.2019', '04.05.2019', '04.05.2019', '09.07.2019', '09.07.2019', '10.07.2019',
             '10.07.2019', '11.07.2019', '11.07.2019', '29.07.2019'],
    'Place': ['Тополев м.', 'Тополев м.', 'Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак', 'Причал',     'Причал', 'Карсакбай', 'Карсакбай',
              'м. Ултарак', 'м. Ултарак', 'Тополев м.'],
    'Instrument': ['сети 20-70 мм', 'сети 12-70 мм', 'сети 20-70 мм', 'сети 12-70 мм', 'сети 12-70 мм', 'сети 20-70 мм', 'сети 12-60 мм',
                   'сети 20-70 мм', 'сети 12-60 мм', 'сети 20-70 мм', 'сети 12-60 мм', 'сети 20-70 мм', 'сети 20-70 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ':   [10,  11,  4,  6, 10,  7,  1,  1,  2,  1,  9, 17, 32],
    'судак': [2,   0,  0,  0,  2,  2,  0,  0,  0,  0, 12,  5, 12],
    'окунь': [21,  38, 15, 27, 39, 22,  4,  5,  1,  1, 23, 19, 26],
    'плотва':[29,  64, 34, 41, 45, 19, 72, 63,  3,  0, 15, 22,  9],
    'щука':  [0,   0,  4,  4,  4,  3,  0,  0,  0,  0,  2,  1,  0],
    'язь':   [0,   0,  0,  0,  0,  0,  1,  2,  0,  0,  1,  0,  0],
     'сазан': [0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    'карась':[15,  12, 17, 21, 15, 17,  0,  0,  0,  0,  0,  0,  0],
    'линь':  [0,   0,  0,  0,  0,  0,  1,  2,  0,  0,  0,  0,  0]
})
data_2019_2.insert(loc=4, column='CatchType', value='научный')
data_2019_2.loc[data_2019_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_2.loc[data_2019_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_2.insert(loc=1, column='Year', value=2019)

data_2019_3 = pd.DataFrame.from_dict({
    'Date': ['26.04.2019', '26.04.2019', '27.04.2019', '27.04.2019', '28.04.2019', '28.04.2019', '28.04.2019', '28.04.2019', '30.04.2019',
             '30.04.2019', '03.07.2019', '03.07.2019', '04.07.2019', '04.07.2019', '05.07.2019', '05.07.2019', '06.07.2019', '06.07.2019'],
    'Place': ['Коржун', 'Коржун', 'Бархот', 'Бархот', 'Аманат', 'Аманат', 'Шенгельды', 'Шенгельды', 'р. Кара Ертис', 'р. Кара Ертис',
              'Коржун', 'Коржун', 'м. Бархот', 'м. Бархот', 'Аманат', 'Аманат', 'Шенгельды', 'Шенгельды'],
    'Instrument': ['сети 12-70 мм', 'сети 12-70 мм', 'сети 12-70 мм', 'сети 12-70 мм', 'сети 12-70 мм', 'сети 12-70 мм', 'сети 12-70 мм',
                   'сети 20-70 мм', 'сети 12-70 мм', 'сети 20-70 мм', 'сети 12-60 мм', 'сети 12-60 мм', 'сети 20-70 мм', 'сети 20-70 мм',
                   'сети 12-60 мм', 'сети 20-70 мм', 'сети 12-60 мм', 'сети 20-70 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ':   [11,  9, 18, 24,  7,  9, 15,  7, 23, 19,  5, 30,  3,  3,  5,  5, 14,  6],
    'судак': [5,  0, 10,  4,  1,  2,  4,  3,  4,  1,  3,  2,  1,  0,  2,  5,  3,  1],
    'окунь': [30, 20, 45, 41, 26, 25, 19, 46, 24, 36, 21, 83, 15,  9, 25, 14, 21,  6],
    'плотва':[39, 66,145, 53, 71, 46, 44, 72, 70, 94, 12,  8, 13,  6, 24,  5, 36, 21],
    'щука':  [5,  8,  0,  0,  1,  2,  5,  4, 10, 11,  0,  0,  0,  0,  0,  0,  0,  0],
    'язь':   [0,  0,  3,  0,  0,  0,  0,  0,  0,  0,  3,  0,  0,  0,  2,  1,  0,  0],
    'сазан': [0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0],
    'карась':[9,  0,  0,  0,  7,  8, 17, 11, 22, 24,  0,  0,  0,  0,  0,  0,  0,  0],
    'линь':  [0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  3,  0,  0,  0,  0,  0,  0,  0],
    'ерш':  [0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  3,  0,  0,  0,  0,  0,  0,  0]
})
data_2019_3.insert(loc=4, column='CatchType', value='научный')
data_2019_3.loc[data_2019_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_3.loc[data_2019_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_3.insert(loc=1, column='Year', value=2019)

# Промысловый неводный улов по Тарбагатайскому побережью
data_2019_4 = pd.DataFrame.from_dict({
    'Date': ['12.03.2019', '13.03.2019', '13.03.2019', '20.05.2019', '20.05.2019', '20.05.2019', '20.05.2019', '20.05.2019', '09.07.2019',
             '09.07.2019', '09.07.2019'],
    'Place': ['Камышзавод', 'Камышзавод', 'Тополев мыс', 'Камышзавод', 'Тополев мыс', 'Бесшана', 'Байтогас', 'Байтогас', 'Причал',
              'Тополев мыс', 'Тополев мыс'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [600, 600, 600, 400, 400, 400, 400, 400, 400, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ':   [992, 2067, 2583, 3798, 3875, 3136, 1808, 1883, 1191, 2584, 1214],
    'судак': [75,  254,  130,   96,  124,   57,   39,   53,   74,  267,  205],
    'окунь': [29,   26,   77,    3,    1,    0,    2,    0,  255,  102,  210],
    'плотва':[0,    0,   34,    3,    0,    0,   10,    0,    0,   23,  142],
    'щука':  [0,   13,    4,    3,    0,    0,    4,    4,    0,    6,   13],
    'карась':[0,    0,    0,    0,    2,    0,    1,    0,    0,    0,    0],
    'язь':   [19,    1,    0,    1,    2,    0,    0,    0,    0,    4,    0]
})
data_2019_4.insert(loc=4, column='CatchType', value='промысловый')
data_2019_4.loc[data_2019_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_4.loc[data_2019_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_4.insert(loc=1, column='Year', value=2019)

# Промысловый неводный улов по Курчумскому побережью — строки 80-92
data_2019_5 = pd.DataFrame.from_dict({
    'Date': ['14.03.2019', '16.05.2019', '04.07.2019', '04.07.2019', '04.07.2019', '04.07.2019'],
    'Place': ['Аманат', 'Жолныскау', 'Бархот', 'Бархот', 'Бархот', 'Бархот'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [600, 300, 400, 350, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ':   [3875, 1808,  517,  388,  775,  497],
    'судак': [590,  132,   65,   73,  132,   93],
    'окунь': [253,    0,   56,   11,   52,   57],
    'плотва':[140,    0,    0,   14,   21,   72],
    'щука':  [49,    3,    5,    6,    9,   11],
    'карась':[16,    5,    0,    0,    0,    0]
})
data_2019_5.insert(loc=4, column='CatchType', value='промысловый')
data_2019_5.loc[data_2019_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_5.loc[data_2019_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_5.insert(loc=1, column='Year', value=2019)

# Промысловый сетный улов по Тарбагатайскому побережью — строки 98-104
data_2019_6 = pd.DataFrame.from_dict({
    'Date': ['11.03.2019', '11.03.2019', '12.03.2019', '12.03.2019', '11.03.2019', '11.03.2019', '11.03.2019'],
    'Place': ['Байтогас', 'Байтогас', 'Байтогас', 'Байтогас', 'Ултарак', 'Ултарак', 'Ултарак'],
    'Instrument': ['сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 50, 50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ':   [42,  88,  92, 129,  83, 102,  94],
    'судак': [5,   4,   4,   5,   6,   4,   3],
    'окунь': [9,  11,   7,  10,  12,   0,   0],
    'плотва': [14,  18,   8,   0,   0,  13,   8],
    'щука':  [3,   3,   3,   3,   3,   4,   4],
    'карась': [0,   5,   2,   0,   3,   6,   3],
    'язь':   [0,   2,   3,   0,   7,   0,   0]
})
data_2019_6.insert(loc=4, column='CatchType', value='промысловый')
data_2019_6.loc[data_2019_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_6.loc[data_2019_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_6.insert(loc=1, column='Year', value=2019)

# Промысловый сетный улов по Курчумскому побережью — строки 111-115
data_2019_7 = pd.DataFrame.from_dict({
    'Date': ['14.03.2019', '16.05.2019', '02.07.2019', '03.07.2019', '03.07.2019'],
    'Place': ['Аманат', 'Коржын', 'Коржын', 'Коржын', 'Коржын'],
    'Instrument': ['сети 50 мм', 'сети 80 мм', 'сети 55 мм', 'сети 55 мм', 'сети 55 мм'],
    'Instrument_size': [50, 50, 50, 55, 55],
    'Area':   [0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ':    [107,  12,  26,  14,  28],
    'судак':  [33,   3,  12,   9,  14],
    'окунь':  [86,   2,   8,   5,   5],
    'карась': [6,   5,   0,   0,   0],
    'щука':   [13,   0,   2,   2,   0]
})
data_2019_7.insert(loc=4, column='CatchType', value='промысловый')
data_2019_7.loc[data_2019_7['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2019_7.loc[data_2019_7['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2019_7.insert(loc=1, column='Year', value=2019)

# общий улов в 2019 году
zhaysan_catch_2019 = pd.concat([data_2019_1, data_2019_2, data_2019_3, data_2019_4, data_2019_5, data_2019_6, data_2019_7], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2019 году
qty_treated_fish_2019 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
        'лещ':    [0, 2, 68, 72, 54,	34,	50,	70,	53,	67,	16,	21,	8,	2,	0],
        'судак':  [1, 3, 128, 87, 30, 9, 2, 1, 0, 0, 0, 0, 0, 0, 0],
        'окунь':  [0, 9, 55, 158, 91, 17, 6, 0, 0, 0, 0, 0, 0, 0, 0],
        'плотва': [0, 57, 92, 132, 34, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        'щука':   [0, 0, 9, 21, 36, 26, 2, 0, 0, 0, 0, 0, 0, 0, 0],
        'сазан':  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        'язь':    [0, 0, 0, 1, 2, 3, 2, 1, 1, 0, 0, 0, 0, 0, 0],
        'карась': [0, 0, 6, 4,	13, 48,	24,	22,	25,	25,	8,	17,	6,	15, 0],
        'линь':   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        'налим':  [0, 0, 0, 1, 2, 1, 0, 2,	0, 0, 0, 0, 0, 0, 0]
})



