import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2017 ГОД
# ============================================================

# Научно-исследовательский неводный улов
data_2017_1 = pd.DataFrame.from_dict({
    'Date': ['29.04.2017', '30.04.2017', '01.05.2017', '02.05.2017', '11.05.2017', '12.05.2017', '13.05.2017', '14.05.2017',
             '20.07.2017', '21.07.2017', '22.07.2017', '23.07.2017'],
    'Place': ['Карсакбай', 'Карсакбай', 'м. Волчий', 'м. Волчий', 'м. Волчий', 'м. Актубек', 'Карсакбай', 'м. Тополев', 'м. Тополев',
              'Карсакбай', 'м. Актубек', 'м. Волчий'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2],
    'лещ': [18, 6, 23, 7, 89, 499, 700, 8, 79, 44, 116, 29],
    'судак': [1, 2, 0, 0, 7, 11, 34, 0, 0, 0, 1, 1],
    'окунь': [5, 1, 9, 0, 6, 26, 15, 0, 0, 2, 0, 2],
    'плотва': [16, 10, 23, 27, 1, 32, 35, 4, 6, 6, 0, 0],
    'щука': [1, 0, 3, 0, 4, 2, 2, 0, 0, 0, 7, 4],
    'язь': [9, 3, 13, 0, 0, 5, 7, 0, 0, 0, 0, 1],
    'сазан': [0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 1, 0],
    'карась': [13, 2, 10, 16, 21, 4, 8, 4, 0, 0, 0, 1]
})
data_2017_1.insert(loc = 4, column='CatchType', value='научный')
data_2017_1.loc[data_2017_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_1.loc[data_2017_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_1.insert(loc=1, column='Year', value=2017)

data_2017_2 = pd.DataFrame.from_dict({
    'Date': ['17.05.2017', '18.05.2017', '19.05.2017', '20.05.2017', '22.05.2017', '13.07.2017', '14.07.2017', '15.07.2017', '16.07.2017', '17.07.2017'],
    'Place': ['Шенгельды', 'Аманат', 'Бархот', 'Аксуат', 'Коржун', 'Коржун', 'Аксуат', 'Бархот', 'Аманат', 'Шенгельды'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2],
    'лещ': [63, 188, 25, 12, 157, 48, 26, 113, 70, 87],
    'судак': [0, 0, 1, 2, 16, 0, 1, 2, 1, 3],
    'окунь': [8, 0, 4, 1, 7, 0, 0, 0, 0, 0],
    'плотва': [1, 0, 0, 3, 2, 2, 0, 0, 2, 0],
    'щука': [0, 0, 0, 0, 5, 1, 1, 1, 1, 1],
    'сазан': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
    'язь': [1, 0, 0, 0, 1, 0, 0, 0, 0, 0],
    'карась': [0, 0, 0, 0, 4, 0, 0, 2, 0, 1]
})
data_2017_2.insert(loc = 4, column='CatchType', value='научный')
data_2017_2.loc[data_2017_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_2.loc[data_2017_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_2.insert(loc=1, column='Year', value=2017)

data_2017_3 = pd.DataFrame.from_dict({
    'Date': ['30.04.2017','30.04.2017','01.05.2017','01.05.2017','02.05.2017','02.05.2017','12.05.2017','12.05.2017','13.05.2017',
             '13.05.2017','14.05.2017','14.05.2017', '15.05.2017','15.05.2017','21.07.2017','21.07.2017','22.07.2017','22.07.2017',
             '22.07.2017','23.07.2017','23.07.2017','24.07.2017','24.07.2017','24.07.2017'],
    'Place': ['Карсакбай','Карсакбай','Карсакбай','Карсакбай','м. Волчий','м. Волчий', 'м. Волчий','м. Волчий','м. Актубек', 'м. Актубек',
              'Карсакбай','Карсакбай', 'м. Тополев','м. Тополев','м. Тополев','м. Тополев','Карсакбай','Карсакбай', 'Карсакбай','м. Актубек',
              'м. Актубек','м. Волчий','м. Волчий','м. Волчий'],
    'Instrument': ['сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм',
                   'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм',
                   'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм', 'сети 12-80 мм',
                   'сети 12-80 мм', 'сети 30-80 мм', 'сети 60-90 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [27, 9, 20, 14, 18, 15, 10, 7, 43, 17, 13, 16, 19, 7, 12, 11, 9, 3, 0, 3, 4, 10, 13, 1],
    'судак': [0, 3, 0, 2, 0, 0, 1, 1, 1, 7, 9, 8, 1, 1, 7, 4, 6, 2, 5, 0, 1, 5, 4, 0],
    'окунь': [10, 11, 8, 6, 31, 7, 10, 10, 11, 5, 14, 9, 5, 6, 28, 18, 46, 9, 0, 17, 24, 31, 10, 0],
    'плотва': [19, 16, 40, 14, 40, 15, 16, 0, 206, 1, 126, 6, 29, 12, 62, 12, 246, 11, 0, 52, 2, 78, 16, 0],
    'язь': [15, 10, 6, 9, 5, 10, 0, 0, 5, 2, 10, 7, 0, 0, 0, 0, 15, 7, 0, 0, 0, 0, 0, 0],
    'сазан': [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'щука': [3, 1, 4, 2, 0, 1, 1, 0, 2, 1, 3, 2, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0],
    'карась': [36, 27, 32, 28, 9, 30, 1, 0, 5, 4, 7, 5, 6, 2, 0, 0, 1, 7, 59, 2, 7, 0, 0, 8]
})
data_2017_3.insert(loc = 4, column='CatchType', value='научный')
data_2017_3.loc[data_2017_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_3.loc[data_2017_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_3.insert(loc=1, column='Year', value=2017)

# Научно-исследовательский сетной улов по Тарбагатайскому побережью
data_2017_4 = pd.DataFrame.from_dict({
    'Date': ['18.05.2017', '18.05.2017', '19.05.2017', '19.05.2017', '20.05.2017', '20.05.2017', '21.05.2017', '21.05.2017', '23.05.2017',
             '23.05.2017', '14.07.2017', '14.07.2017', '15.07.2017', '15.07.2017', '16.07.2017', '16.07.2017', '17.07.2017', '18.07.2017', '18.07.2017'],
    'Place': ['Шенгельды', 'Шенгельды', 'Аманат', 'Аманат', 'Бархот', 'Бархот', 'Аксуат', 'Аксуат', 'Коржун', 'Коржун', 'Коржун', 'Коржун',
              'Аксуат', 'Аксуат', 'Бархот', 'Бархот', 'Аманат', 'Шенгельды', 'Шенгельды'],
    'Instrument': ['Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм',
                   'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм',
                   'Сети 12-80мм', 'Сети 12-80мм', 'Сети 12-80мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [38, 29, 27, 16, 10, 12, 5, 4, 6, 7, 2, 0, 12, 3, 5, 1, 7, 3, 2],
     'судак': [1, 0, 4, 2, 11, 3, 4, 4, 3, 1, 1, 2, 9, 4, 7, 5, 8, 2, 1],
    'окунь': [5, 2, 29, 16, 4, 3, 0, 0, 21, 8, 18, 15, 45, 15, 5, 6, 16, 62, 20],
    'плотва': [8, 4, 37, 3, 8, 0, 11, 2, 18, 2, 45, 19, 76, 56, 17, 7, 22, 26, 21],
     'щука': [0, 0, 1, 2, 0, 0, 0, 0, 2, 4, 2, 1, 1, 1, 1, 0, 1, 2, 1],
     'язь': [0, 1, 6, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     'карась': [3, 0, 4, 10, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 1, 0, 0],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0]
})
data_2017_4.insert(loc = 4, column='CatchType', value='научный')
data_2017_4.loc[data_2017_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_4.loc[data_2017_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_4.insert(loc=1, column='Year', value=2017)

# Промысловый неводный улов по Курчумскому побережью
data_2017_5 = pd.DataFrame.from_dict({
    'Date': ['28.03.2017', '28.03.2017', '29.03.2017', '29.03.2017', '29.03.2017', '29.03.2017', '29.03.2017', '29.03.2017', '30.03.2017',
             '30.03.2017', '31.03.2017', '31.03.2017', '19.07.2017', '20.07.2017', '20.07.2017', '20.07.2017', '23.07.2017', '05.09.2017',
             '05.09.2017', '05.09.2017', '05.09.2017'],
    'Place': ['м.Актубек', 'м.Актубек', 'Причал', 'м.Актубек', 'м.Актубек', 'м.Актубек', 'м.Актубек', 'м.Актубек', 'Причал', 'Камышзав', 'Камышзав',
              'Камышзав', 'м.Тополев', 'м.Тополев', 'м.Тополев', 'м.Тополев', 'м.Актубек', 'Камышзав', 'Камышзав', 'Бесшана', 'Бесшана'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод',
                   'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400],
    'Area': [3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [1014, 344, 1379, 362, 413, 346, 448, 517, 348, 1423, 931, 1051, 706, 612, 1332, 967, 647, 517, 384, 1206, 588],
    'судак': [157, 26, 21, 17, 26, 18, 29, 19, 0, 18, 31, 16, 22, 17, 87, 35, 33, 58, 47, 23, 35],
    'окунь': [28, 0, 34, 55, 0, 56, 29, 0, 0, 16, 21, 12, 0, 0, 41, 56, 16, 6, 0, 0, 24],
    'плотва': [2, 1, 4, 2, 0, 0, 4, 0, 0, 2, 0, 4, 0, 3, 0, 4, 0, 2, 0, 0, 4],
    'щука': [9, 4, 3, 9, 6, 0, 0, 0, 0, 0, 0, 2, 0, 5, 11, 14, 0, 27, 19, 2, 3],
    'карась': [0, 16, 0, 8, 19, 0, 17, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0]
})
data_2017_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2017_5.loc[data_2017_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_5.loc[data_2017_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_5.insert(loc=1, column='Year', value=2017)

# Промысловый сетный улов по Тарбагатайскому побережью
data_2017_6 = pd.DataFrame.from_dict({
    'Date': ['15.07.2017', '16.07.2017', '16.07.2017'],
    'Place': [ 'Аманат', 'Аманат', 'Аманат'],
    'Instrument': ['невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400],
    'Area': [5.2, 5.2, 5.2],
    'лещ': [517, 448, 379],
    'судак': [89, 66, 46],
    'окунь': [33, 28, 22],
    'плотва': [0, 3, 0],
    'щука': [10, 7, 3],
    'карась': [2, 0, 0],
    'сазан': [0, 0, 3]
})
data_2017_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2017_6.loc[data_2017_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2017_6.loc[data_2017_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2017_6.insert(loc=1, column='Year', value=2017)

# общий улов в 2017 году
zhaysan_catch_2017 = pd.concat([data_2017_1, data_2017_2, data_2017_3, data_2017_4, data_2017_5, data_2017_6], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2017 году
qty_treated_fish_2017 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ':     [3, 12, 83, 276, 42, 49, 27, 36, 9, 8, 3, 3, 3, 10, 0],
         'судак':   [12, 52, 128, 41, 15, 14, 10, 6, 2, 1, 0, 0, 0, 0, 0],
         'окунь':   [12, 18, 65, 134, 123, 36, 7, 0, 2, 2, 0, 1, 0, 0, 0],
         'плотва':  [3, 38, 144, 70, 54, 26, 16, 6, 3, 0, 0, 0, 0, 0, 0],
         'щука':    [0, 4, 39, 20, 41, 8, 11, 2, 2, 0, 0, 0, 0, 0, 0],
         'сазан':   [2, 1, 2, 1, 1, 5, 7, 6, 1, 0, 0, 0, 0, 0, 0],
         'язь':     [0, 0, 16, 52, 49, 15, 15, 1, 1, 0, 1, 0, 0, 0, 0],
         'карась':  [0, 0, 1, 2, 18, 52, 50, 13, 11, 7, 4, 3, 0, 0, 0],
         'линь':    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим':   [0, 0,	0,	0,	0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0]
})

