import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2022 ГОД
# ============================================================

data_2022_1 = pd.DataFrame.from_dict({
    'Date': ['19.05.2022', '20.05.2022', '22.05.2022', '23.05.2022', '25.05.2022', '21.07.2022', '23.07.2022', '24.07.2022',
             '27.07.2022', '28.07.2022', '30.07.2022'],
    'Place': ['м. Тополев', 'м. Тополев', 'Аманат', 'м. Бархот', 'Коржун', 'м. Волчий', 'п. Карсакбай', 'м. Тополев', 'Аманат', 'м. Бархот', 'м. Коржун'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4],
    'лещ': [216, 52, 48, 272, 149, 20, 13, 27, 25, 36, 10],
    'судак': [3, 1, 1, 26, 1, 5, 11, 16, 8, 14, 13],
    'окунь': [0, 1, 0, 11, 1, 14, 20, 8, 10, 18, 33],
    'плотва': [5, 1, 0, 1, 5, 7, 21, 13, 7, 12, 26],
    'щука': [1, 0, 0, 2, 2, 2, 1, 5, 2, 7, 5],
    'сазан': [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0],
    'язь': [0, 0, 3, 3, 1, 0, 0, 0, 0, 2, 1],
    'карась': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14],
    'ерш': [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'линь': [0, 0, 0, 2, 0, 1, 0, 0, 0, 0, 0]
})
data_2022_1.insert(loc = 4, column='CatchType', value='научный')
data_2022_1.loc[data_2022_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_1.loc[data_2022_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_1.insert(loc=1, column='Year', value=2022)

data_2022_2 = pd.DataFrame.from_dict({
    'Date': ['19.05.2022', '19.05.2022', '20.05.2022', '21.07.2022', '21.07.2022', '23.07.2022', '23.07.2022', '24.07.2022', '24.07.2022'],
    'Place': ['м. Волчий', 'м. Волчий', 'м. Тополев', 'м. Волчий', 'м. Волчий', 'Карсакбай', 'Карсакбай', 'м. Тополев', 'м. Тополев'],
    'Instrument': ['сети 30-70 мм', 'сети 30-70 мм', 'сети 30-70 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [1, 1, 0, 7, 7, 5, 7, 5, 3],
    'судак': [1, 2, 0, 3, 2, 6, 3, 5, 4],
    'окунь': [0, 0, 0, 17, 24, 18, 14, 13, 24],
    'плотва': [0, 0, 0, 29, 19, 19, 26, 19, 24],
    'щука': [0, 0, 0, 0, 2, 1, 1, 3, 3],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 2, 0],
    'язь': [0, 0, 0, 0, 0, 0, 0, 0, 0],
    'карась': [0, 0, 0, 0, 0, 0, 0, 0, 0],
    'ерш': [2, 0, 5, 0, 0, 0, 4, 0, 0],
    'линь': [0, 0, 0, 1, 0, 0, 0, 0, 0]
})
data_2022_2.insert(loc = 4, column='CatchType', value='научный')
data_2022_2.loc[data_2022_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_2.loc[data_2022_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_2.insert(loc=1, column='Year', value=2022)

data_2022_3 = pd.DataFrame.from_dict({
    'Date': ['21.05.2022', '21.05.2022', '22.05.2022', '22.05.2022', '23.05.2022', '23.05.2022', '24.05.2022', '24.05.2022', '25.05.2022',
             '25.05.2022', '26.07.2022', '26.07.2022', '27.07.2022', '27.07.2022', '28.07.2022', '28.07.2022', '30.07.2022', '30.07.2022'],
    'Place': ['Кара-Ертис', 'Кара-Ертис', 'Кара-Ертис', 'Кара-Ертис', 'Аманат', 'Аманат', 'м. Бархот', 'м. Бархот', 'м. Коржун', 'м. Коржун',
              'Кара-Ертис', 'Кара-Ертис', 'Аманат', 'Аманат', 'м. Бархот', 'м. Бархот', 'м. Коржун', 'м. Коржун'],
    'Instrument': ['сети 20-70 мм', 'сети 30-80 мм', 'сети 20-70 мм', 'сети 30-80 мм', 'сети 20-70 мм', 'сети 30-80 мм', 'сети 20-70 мм',
                   'сети 30-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [18, 8, 37, 34, 0, 1, 22, 13, 4, 10, 6, 2, 4, 5, 10, 8, 3, 8],
    'судак': [0, 1, 0, 0, 0, 0, 13, 10, 2, 2, 6, 3, 4, 2, 3, 2, 2, 0],
    'окунь': [4, 2, 2, 9, 0, 0, 9, 13, 5, 4, 30, 12, 25, 30, 38, 35, 13, 15],
    'плотва': [19, 9, 7, 0, 0, 0, 14, 10, 17, 25, 30, 20, 36, 42, 34, 40, 18, 18],
    'щука': [0, 0, 1, 3, 0, 0, 0, 0, 0, 1, 1, 5, 3, 0, 1, 2, 1, 2],
    'сазан': [0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь': [2, 4, 0, 4, 0, 0, 2, 1, 0, 0, 1, 2, 0, 0, 1, 0, 0, 0],
    'карась': [1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 1],
    'ерш': [2, 0, 0, 0, 1, 1, 18, 8, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0],
    'линь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 2, 0, 0, 0]
})
data_2022_3.insert(loc = 4, column='CatchType', value='научный')
data_2022_3.loc[data_2022_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_3.loc[data_2022_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_3.insert(loc=1, column='Year', value=2022)

data_2022_4 = pd.DataFrame.from_dict({
    'Date': ['01.03.2022', '22.07.2022', '23.07.2022', '24.07.2022', '24.07.2022', '27.10.2022', '27.10.2022', '27.10.2022', '28.10.2022'],
    'Place': ['Ултарак', 'уч. Карсакбай', 'м. Тополев', 'м. Тополев', 'уч. Бесшана', 'р/у №2', 'р/у №3', 'р/у №2', 'р/у №2'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400, 450, 400, 400, 400, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [4966, 2715, 1986, 1655, 1655, 3310, 1655, 1655, 2963],
    'судак': [169, 326, 77, 154, 154, 616, 308, 77, 269],
    'окунь': [0, 0, 74, 37, 518, 703, 37, 37, 422],
    'плотва': [0, 110, 152, 42, 339, 85, 34, 25, 59],
    'щука': [11, 24, 15, 0, 10, 25, 15, 37, 27],
    'язь': [0, 0, 0, 0, 0, 9, 0, 0, 15]
})
data_2022_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2022_4.loc[data_2022_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_4.loc[data_2022_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_4.insert(loc=1, column='Year', value=2022)

data_2022_5 = pd.DataFrame.from_dict({
    'Date': ['29.10.2022', '29.10.2022', '30.10.2022'],
    'Place': ['р/у № 5', 'р/у № 5', 'р/у № 5'],
    'Instrument': ['невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400],
    'Area': [5.2, 5.2, 5.2],
    'лещ': [265, 993, 745],
    'судак': [61, 154, 200],
    'окунь': [74, 22, 27],
    'плотва': [0, 34, 101],
    'щука': [10, 10, 13],
    'язь': [0, 3, 6],
    'карась': [0, 4, 6]
})
data_2022_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2022_5.loc[data_2022_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_5.loc[data_2022_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_5.insert(loc=1, column='Year', value=2022)

data_2022_6 = pd.DataFrame.from_dict({
    'Date': ['28.02.2022', '28.02.2022', '28.02.2022', '27.10.2022', '28.10.2022'],
    'Place': ['м. Тополев', 'Байтогас', 'Байтогас', 'р/у №3', 'р/у №3'],
    'Instrument': ['сети 50-55 мм', 'сети 50-55 мм', 'сети 50-55 мм', 'сети 55 мм', 'сети 55 мм'],
    'Instrument_size': [50, 50, 50, 55, 55],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [73, 51, 44, 231, 198],
    'судак': [11, 26, 18, 53, 67],
    'окунь': [53, 28, 27, 59, 127],
    'плотва': [111, 18, 33, 16, 59],
    'щука': [2, 7, 12, 13, 14],
    'карась': [0, 5, 4, 0, 0]
})
data_2022_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2022_6.loc[data_2022_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_6.loc[data_2022_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_6.insert(loc=1, column='Year', value=2022)

data_2022_7 = pd.DataFrame.from_dict({
    'Date': ['27.02.2022', '27.02.2022', '30.10.2022', '30.10.2022'],
    'Place': ['Аксуат', 'Жолнускау', 'Аманат', 'Аманат'],
    'Instrument': ['сети 60-65 мм', 'сети 55 мм', 'сети 70 мм', 'сети 65 мм'],
    'Instrument_size': [60, 55, 70, 65],
    'Area': [0.0, 0.0, 0.0, 0.0],
    'лещ': [50, 73, 99, 331],
    'судак': [51, 13, 26, 23],
    'окунь': [29, 49, 51, 22],
    'плотва': [0, 34, 16, 16],
    'щука': [10, 4, 3, 7],
    'карась': [0, 0, 0, 0]
})
data_2022_7.insert(loc = 4, column='CatchType', value='промысловый')
data_2022_7.loc[data_2022_7['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2022_7.loc[data_2022_7['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2022_7.insert(loc=1, column='Year', value=2022)

# общий улов в 2022 году
zhaysan_catch_2022 = pd.concat([data_2022_1, data_2022_2, data_2022_3, data_2022_4, data_2022_5, data_2022_6, data_2022_7], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2022 году
qty_treated_fish_2022 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ': [0, 9, 147, 223, 27, 30, 40, 35, 14, 9,	16,	9, 12, 0, 0],
         'судак': [3, 27, 135, 57, 31, 3, 2, 0, 0, 0, 0, 0, 0, 0, 0],
         'окунь': [0, 48, 143, 109, 38, 6, 2, 2, 0, 0, 0, 0, 0, 0, 0],
         'плотва': [0, 22, 114, 186, 134, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'щука': [0, 0, 10, 36, 16, 4, 5, 2, 0, 0, 0, 0, 0, 0, 0],
         'сазан': [0, 4, 3, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
         'язь': [0, 2, 1, 8, 13, 5, 4, 0, 0, 0, 0, 0, 0, 0, 0],
         'карась': [0, 3, 10, 9, 6, 3, 1, 3, 3, 0, 0, 0, 0, 0, 0],
         'линь': [0, 0, 1, 3, 3, 3, 2, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим': [0, 0, 2, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})

