import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2018 ГОД
# ============================================================

# Научно-исследовательский неводный улов — строки 5-18
data_2018_1 = pd.DataFrame.from_dict({
    'Date': ['10.05.2018', '11.05.2018', '01.08.2018', '02.08.2018', '03.08.2018', '04.08.2018', '05.08.2018', '07.08.2018', '08.08.2018', '09.08.2018'],
    'Place': ['м. Тополев', 'Карсакбай', 'Коржун', 'Аксуат', 'м. Бархот', 'Аманат', 'Шенгельды', 'м. Тополев', 'Карсакбай', 'м. Ултарак'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2],
    'лещ': [13, 17, 4, 113, 41, 13, 82, 23, 19, 11],
    'судак': [0, 11, 2, 18, 2, 1, 1, 3, 3, 11],
    'окунь': [0, 3, 5, 20, 8, 14, 4, 11, 8, 4],
    'плотва': [0, 0, 0, 9, 0, 0, 15, 5, 11, 5],
    'щука': [1, 1, 1, 2, 1, 2, 3, 0, 1, 1],
    'язь': [0, 0, 0, 15, 2, 0, 0, 0, 0, 0],
    'карась': [2, 2, 0, 0, 0, 0, 0, 0, 1, 0]
})
data_2018_1.insert(loc = 4, column='CatchType', value='научный')
data_2018_1.loc[data_2018_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_1.loc[data_2018_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_1.insert(loc=1, column='Year', value=2018)

data_2018_2 = pd.DataFrame.from_dict({
    'Date': ['12.05.2018', '12.05.2018', '13.05.2018', '13.05.2018', '08.08.2018', '08.08.2018', '09.08.2018', '09.08.2018', '09.08.2018', '10.08.2018', '10.08.2018'],
    'Place': ['Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак', 'м. Тополев', 'м. Тополев', 'Карсакбай', 'Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак'],
    'Instrument': ['сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм',
                   'сети 20-80 мм', 'сети 40-55 мм', 'сети 12-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [5, 5, 8, 6, 49, 40, 47, 45, 0, 45, 42],
    'судак': [1, 3, 3, 1, 4, 2, 14, 11, 107, 14, 7],
    'окунь': [3, 6, 6, 12, 39, 22, 39, 29, 17, 36, 37],
    'плотва': [105, 97, 143, 114, 34, 32, 53, 32, 0, 42, 33],
    'щука': [0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0],
    'сазан': [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
    'карась': [1, 2, 3, 0, 0, 0, 0, 1, 0, 1, 0]
})
data_2018_2.insert(loc = 4, column='CatchType', value='научный')
data_2018_2.loc[data_2018_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_2.loc[data_2018_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_2.insert(loc=1, column='Year', value=2018)

data_2018_3 = pd.DataFrame.from_dict({
    'Date': ['07.05.2018', '07.05.2018', '08.05.2018', '08.05.2018', '02.08.2018', '02.08.2018', '03.08.2018', '03.08.2018', '04.08.2018',
             '04.08.2018', '05.08.2018', '05.08.2018', '06.08.2018', '06.08.2018'],
    'Place': ['Коржун', 'Коржун', 'м. Бархот', 'м. Бархот', 'Коржун', 'Коржун', 'Аксуат', 'Аксуат', 'м. Бархот', 'м. Бархот', 'Аманат',
              'Аманат', 'Шенгельды', 'Шенгельды'],
    'Instrument': ['сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм',
                   'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм', 'сети 12-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [9, 8, 9, 4, 23, 20, 25, 37, 54, 39, 32, 16, 49, 79],
    'судак': [0, 1, 0, 0, 7, 6, 8, 7, 9, 7, 2, 1, 3, 6],
    'окунь': [22, 11, 20, 11, 27, 25, 17, 28, 21, 24, 21, 29, 27, 46],
    'плотва': [264, 238, 177, 200, 30, 37, 35, 15, 34, 38, 28, 17, 43, 62],
    'язь': [0, 0, 0, 0, 0, 0, 3, 3, 4, 3, 4, 1, 1, 3],
    'сазан': [0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0],
    'щука': [9, 8, 9, 4, 23, 20, 25, 37, 54, 39, 32, 16, 49, 79],
    'карась': [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]
})
data_2018_3.insert(loc = 4, column='CatchType', value='научный')
data_2018_3.loc[data_2018_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_3.loc[data_2018_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_3.insert(loc=1, column='Year', value=2018)

# Промысловый неводный улов по Тарбагатайскому побережью — строки 68-78
data_2018_4 = pd.DataFrame.from_dict({
    'Date': ['18.03.2018', '19.03.2018', '19.03.2018', '06.08.2018', '06.08.2018', '07.08.2018', '07.08.2018', '09.08.2018'],
    'Place': ['Камышзавод', 'Камышзавод', 'Камышзавод', 'м. Тополев', 'м. Тополев', 'м. Тополев', 'м. Тополев', 'Байтогас'],
    'Instrument': ['невод', 'невод', 'невод', 'невод','невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [600, 600, 600, 600, 600, 600, 600, 450],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [1105, 1333, 667, 603, 730, 933, 1067, 1267],
     'судак': [133, 178, 17, 14, 9, 10, 109, 120],
    'окунь': [25, 51, 20, 23, 15, 16, 10, 55],
    'плотва': [20, 0, 12, 0, 0, 15, 12, 46],
     'щука': [18, 6, 9, 3, 2, 4, 2, 5],
     'язь': [17, 14, 0, 0, 0, 0, 0, 0],
     'карась': [4, 3, 11, 0, 0, 6, 3, 0]
})
data_2018_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2018_4.loc[data_2018_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_4.loc[data_2018_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_4.insert(loc=1, column='Year', value=2018)

# Промысловый неводный улов по Курчумскому побережью — строки 80-92
data_2018_5 = pd.DataFrame.from_dict({
    'Date': ['17.03.2018', '17.03.2018', '17.03.2018'],
    'Place': ['м. Бакланий', 'м. Бакланий', 'м. Бакланий'],
    'Instrument': ['невод', 'невод', 'невод'],
    'Instrument_size': [600, 600, 600],
    'Area': [5.2, 5.2, 5.2],
    'лещ': [1333, 967, 1023],
    'судак': [256, 211, 244],
    'окунь': [50, 56, 50],
    'плотва': [50, 20, 14],
    'щука': [2, 2, 2],
    'карась': [5, 6, 0]
})
data_2018_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2018_5.loc[data_2018_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_5.loc[data_2018_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_5.insert(loc=1, column='Year', value=2018)

# Промысловый сетный улов по Тарбагатайскому побережью — строки 98-104
data_2018_6 = pd.DataFrame.from_dict({
    'Date': ['18.03.2018', '18.03.2018', '18.03.2018', '18.03.2018', '19.03.2018', '19.03.2018'],
    'Place': ['Карсакбай', 'Карсакбай', 'Карсакбай', 'Карсакбай', 'Карсакбай', 'Карсакбай'],
    'Instrument': ['сети 55 мм', 'сети 55 мм', 'сети 55 мм', 'сети 55 мм', 'сети 55 мм', 'сети 55 мм'],
    'Instrument_size': [50, 50, 50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [67, 83, 68, 89, 93, 56],
    'судак': [5, 6, 3, 2, 4, 9],
    'окунь': [2, 3, 0, 5, 6, 8],
    'плотва': [0, 32, 0, 0, 50, 45],
    'карась': [0, 5, 0, 3, 0, 0],
    'щука': [3, 2, 5, 2, 2, 4]
})
data_2018_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2018_6.loc[data_2018_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_6.loc[data_2018_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_6.insert(loc=1, column='Year', value=2018)

# Промысловый сетный улов по Курчумскому побережью — строки 111-115
data_2018_7 = pd.DataFrame.from_dict({
    'Date': ['16.03.2018', '16.03.2018', '16.03.2018', '16.03.2018'],
    'Place': ['м. Бархот', 'м. Бархот', 'м. Бархот', 'м. Бархот'],
    'Instrument': ['сети 70 мм', 'сети 70 мм', 'сети 50 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0],
    'лещ': [43, 79, 56, 61],
    'судак': [8, 15, 6, 8],
    'окунь': [0, 0, 26, 0],
    'плотва': [0, 0, 23, 0],
    'щука': [11, 14, 6, 9]
})
data_2018_7.insert(loc = 4, column='CatchType', value='промысловый')
data_2018_7.loc[data_2018_7['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2018_7.loc[data_2018_7['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2018_7.insert(loc=1, column='Year', value=2018)

# общий улов в 2018 году
zhaysan_catch_2018 = pd.concat([data_2018_1, data_2018_2, data_2018_3, data_2018_4, data_2018_5, data_2018_6, data_2018_7], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2018 году
qty_treated_fish_2018 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ':     [4, 17,	40,	126, 141, 64, 19, 30, 20, 9, 6, 7, 9, 4, 0],
         'судак':   [1, 34,	101, 113, 42, 2, 1, 0, 0, 1, 0, 0, 0, 0, 0],
         'окунь':   [3,	48,	81,	154, 113, 23, 14, 1, 0, 0, 0, 0, 0, 0, 0],
         'плотва':  [3,	30,	95,	123, 136, 63, 6, 0,	0, 0, 0, 0, 0, 0, 0],
         'щука':    [0, 1,	7,	10,	15,	4,	7,	4,	1, 0, 0, 0, 0, 0, 0],
         'сазан':   [0,	0,	0,	1,	0,	0,	0,	0,	0, 0, 0, 0, 0, 0, 0],
         'язь':     [0,	1,	12,	9,	6,	1,	4,	2,	1,	0,	0, 0, 0, 0, 0],
         'карась':  [0,	0,	4,	5,	2,	6,	9,	2,	1,	5,	3,	4,	0,	0, 0],
         'линь':    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим':   [0, 0,	0,	0,	0,	1,	2,	2,	5, 0, 0, 0, 0, 0, 0]
})



