import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2020 ГОД
# ============================================================

data_2020_1 = pd.DataFrame.from_dict({
    'Date': ['03.05.2020', '04.05.2020', '05.05.2020', '09.05.2020', '10.05.2020', '11.05.2020', '13.05.2020', '24.07.2020', '25.07.2020',
             '29.07.2020', '02.08.2020', '04.08.2020', '05.08.2020', '07.08.2020'],
    'Place': ['Коржун', 'Бархот', 'Аманат', 'м. Тополев', 'Карсакбай', 'Ултарак', 'м.Волчий', 'Коржун', 'Бархот', 'Аманат', 'м.Топалев', 'Карсакбай', 'м. Ултарак', 'м.Волчий'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.44, 0.44, 0.44, 0.44, 0.44, 0.44, 0.44, 0.44],
    'лещ': [11, 48, 8, 8, 65, 6, 52, 273, 75, 57, 200, 273, 17, 64],
    'судак': [2, 0, 0, 2, 0, 3, 10, 6, 2, 5, 0, 10, 11, 2],
    'окунь': [2, 0, 0, 3, 0, 3, 12, 3, 13, 16, 0, 34, 7, 7],
    'плотва': [8, 4, 14, 15, 16, 18, 29, 139, 5, 0, 1, 31, 0, 36],
    'щука': [3, 4, 3, 1, 3, 1, 1, 5, 0, 1, 0, 1, 0, 4],
    'сазан': [2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0, 0, 0, 40, 4, 0, 0, 0, 0],
    'карась': [1, 2, 1, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      'линь': [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]
})
data_2020_1.insert(loc = 4, column='CatchType', value='научный')
data_2020_1.loc[data_2020_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_1.loc[data_2020_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_1.insert(loc=1, column='Year', value=2020)

data_2020_2 = pd.DataFrame.from_dict({
    'Date': ['09.05.2020', '09.05.2020', '10.05.2020', '10.05.2020', '11.05.2020', '11.05.2020', '13.05.2020', '13.05.2020', '02.08.2020',
             '02.08.2020', '04.08.2020', '04.08.2020', '05.08.2020', '05.08.2020', '07.08.2020', '07.08.2020'],
    'Place': ['Тополев м.', 'Тополев м.', 'Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак', 'м.Волчий', 'м.Волчий', 'Тополев м.',
              'Тополев м.', 'Карсакбай', 'Карсакбай', 'м. Ултарак', 'м. Ултарак', 'м.Волчий', 'м.Волчий'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [4, 3, 5, 5, 6, 13, 6, 9, 1, 3, 7, 3, 3, 5, 4, 0],
    'судак': [3, 0, 4, 0, 3, 3, 4, 9, 1, 8, 1, 3, 6, 18, 4, 5],
    'окунь': [23, 32, 26, 22, 26, 38, 38, 49, 0, 7, 4, 4, 21, 13, 56, 32],
    'плотва': [43, 29, 72, 54, 81, 54, 57, 84, 6, 35, 103, 106, 148, 106, 124, 95],
    'щука': [2, 1, 2, 3, 0, 1, 0, 0, 2, 1, 0, 1, 2, 1, 2, 1],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0],
    'язь': [0, 0, 0, 1, 0, 0, 0, 0, 4, 11, 10, 0, 3, 0, 0, 0],
    'карась': [0, 1, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'линь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 5, 1, 0, 0]
})
data_2020_2.insert(loc = 4, column='CatchType', value='научный')
data_2020_2.loc[data_2020_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_2.loc[data_2020_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_2.insert(loc=1, column='Year', value=2020)

data_2020_3 = pd.DataFrame.from_dict({
    'Date': ['03.05.2020', '03.05.2020', '04.05.2020', '04.05.2020', '05.05.2020', '05.05.2020', '06.05.2020', '06.05.2020', '24.07.2020',
             '24.07.2020', '25.07.2020', '25.07.2020', '29.07.2020', '29.07.2020', '30.07.2020','30.07.2020'],
    'Place': ['Коржун', 'Коржун','Бархот', 'Бархот','Аманат', 'Аманат','р. Кара Ертис', 'р. Кара Ертис', 'Коржун', 'Коржун','Бархот',
              'Бархот','Аманат', 'Аманат','р. Кара Ертис', 'р. Кара Ертис'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [2, 2, 2, 0, 11, 3, 9, 7, 7, 1, 5, 7, 8, 33, 6, 0],
    'судак': [2, 3, 3, 3, 3, 5, 0, 1, 7, 6, 4, 8, 6, 8, 1, 3],
    'окунь': [26, 20, 17, 10, 11, 32, 18, 27, 11, 4, 1, 0, 10, 9, 5, 6],
    'плотва': [28, 21, 49, 64, 23, 14, 25, 23, 7, 25, 30, 9, 60, 90, 3, 6],
    'язь': [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 2],
    'сазан': [0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'щука': [3, 1, 2, 4, 2, 2, 2, 3, 7, 0, 0, 1, 0, 1, 1, 1],
    'карась': [0, 3, 1, 2, 3, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0],
    'линь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0]
})
data_2020_3.insert(loc = 4, column='CatchType', value='научный')
data_2020_3.loc[data_2020_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_3.loc[data_2020_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_3.insert(loc=1, column='Year', value=2020)

data_2020_4 = pd.DataFrame.from_dict({
    'Date': ['01.08.2020', '01.08.2020', '03.08.2020', '10.10.2020', '10.10.2020', '10.10.2020', '11.10.2020'],
    'Place': ['Тополев мыс', 'Причал', 'Карсакбай', 'м. Тополев', 'м. Тополев', 'Карсакбай', 'Карсакбай'],
    'Instrument': ['невод', 'невод', 'невод', 'невод','невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400, 400, 400, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [865, 519, 2107, 900, 1211, 2163, 519],
    'судак': [138, 76, 482, 128, 161, 104, 76],
    'окунь': [34, 134, 564, 0, 34, 20, 34],
    'плотва': [27, 80, 239, 0, 21, 0, 0],
    'линь': [0, 2, 0, 0, 0, 0, 0],
    'щука': [0, 31, 7, 9, 18, 4, 4],
    'карась': [8, 0, 0, 8, 0, 0, 0]
})
data_2020_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2020_4.loc[data_2020_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_4.loc[data_2020_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_4.insert(loc=1, column='Year', value=2020)

data_2020_5 = pd.DataFrame.from_dict({
    'Date': ['09.03.2020', '24.04.2020', '25.07.2020'],
    'Place': ['Аманат', 'м.Караганды', 'Бархот'],
    'Instrument': ['невод', 'невод', 'невод'],
    'Instrument_size': [400, 250, 300],
    'Area': [5.2, 5.2, 5.2],
    'лещ': [1730, 52, 159],
    'судак': [38, 9, 23],
    'окунь': [34, 34, 7],
    'плотва': [27, 0, 0],
    'щука': [0, 5, 3],
    'налим': [2, 0, 2],
    'линь': [0, 0, 1],
    'карась': [0, 0, 0],
    'язь': [0, 0, 0]
})
data_2020_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2020_5.loc[data_2020_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_5.loc[data_2020_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_5.insert(loc=1, column='Year', value=2020)

data_2020_6 = pd.DataFrame.from_dict({
    'Date': ['05.03.2020', '05.03.2020', '05.03.2020', '05.03.2020', '05.03.2020', '06.03.2020', '06.03.2020', '06.03.2020', '06.03.2020'],
    'Place': ['Ултарак', 'Ултарак', 'Ултарак', 'Ултарак', 'Ултарак', 'Байтогас', 'Байтогас', 'Байтогас', 'Байтогас'],
    'Instrument': ['сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 45-70 мм', 'сети 45-70 мм','сети 50-55 мм','сети 50-70 мм',
                    'сети 60-65 мм', 'сети 60-65 мм'],
    'Instrument_size': [50, 50, 50, 55, 55, 50, 50, 50, 55],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [3, 25, 46, 8, 4, 0, 18, 31, 20],
    'судак': [5, 4, 11, 0, 0, 22, 26, 9, 3],
    'окунь': [136, 10, 9, 7, 1, 42, 41, 9, 0],
    'плотва': [0, 7, 0, 0, 0, 57, 69, 0, 0],
    'щука': [53, 5, 36, 6, 2, 3, 9, 2, 1]
})
data_2020_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2020_6.loc[data_2020_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_6.loc[data_2020_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_6.insert(loc=1, column='Year', value=2020)

data_2020_7 = pd.DataFrame.from_dict({
    'Date': ['09.03.2020','10.03.2020','10.03.2020','10.03.2020','24.07.2020', '09.10.2020','09.10.2020','09.10.2020','09.10.2020'],
    'Place': ['Аманат', 'Аксуат', 'Аксуат', 'Аксуат', 'Коржун','Жолнускай', 'Жолнускай', 'Жолнускай', 'Жолнускай'],
    'Instrument': ['сети 60 мм', 'сети 50 мм', 'сети 50-55 мм', 'сети 50 мм', 'сети 55 мм','сети 50-55 мм', 'сети 50 мм', 'сети 55-70 мм', 'сети 50-70 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [20, 28, 59, 38, 52, 119, 69, 52, 100],
    'судак': [10, 9, 15, 16, 8, 46, 23, 76, 72],
    'окунь': [3, 0, 0, 0, 16, 34, 34, 0, 0],
    'плотва': [9, 0, 0, 1, 11, 0, 0, 0, 0],
    'линь': [2, 0, 0, 0, 3, 2, 0, 0, 0],
    'щука': [2, 0, 6, 2, 7, 0, 0, 1, 1],
    'карась': [0, 0, 0, 0, 13, 0, 0, 0, 0]
})
data_2020_7.insert(loc = 4, column='CatchType', value='промысловый')
data_2020_7.loc[data_2020_7['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2020_7.loc[data_2020_7['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2020_7.insert(loc=1, column='Year', value=2020)

# общий улов в 2020 году
zhaysan_catch_2020 = pd.concat([data_2020_1, data_2020_2, data_2020_3, data_2020_4, data_2020_5, data_2020_6, data_2020_7], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2020 году
qty_treated_fish_2020 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
        'лещ':     [0, 10, 106, 156, 86, 54, 43, 22, 27, 23, 10, 7, 9, 8, 0],
        'судак':   [19, 51, 157, 80, 31, 12, 1, 1,	0, 0, 0, 0, 0, 0, 0],
        'окунь':   [0, 55, 128, 135, 128, 33, 6, 1, 2, 0, 0, 0, 0, 0, 0],
        'плотва':  [0, 82, 201, 78, 89, 37, 1,	1, 0, 0, 0, 0, 0, 0, 0],
        'щука':    [0, 0, 8, 52, 26, 20, 8, 2, 0, 0 , 0, 0, 0, 0, 0],
        'сазан':   [0, 0, 2, 4, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
        'язь':     [0, 4, 40, 5, 15, 12, 3, 1, 0, 1, 0, 0, 0, 0, 0],
        'карась':  [0, 0, 0, 0, 2,	2, 6, 4, 3, 1, 2, 3, 2, 0, 0],
        'линь':    [0, 0, 0, 4, 6, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})
