import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2024 ГОД
# ============================================================

data_2024_1 = pd.DataFrame.from_dict({
    'Date': ['10.05.2024', '12.05.2024', '12.05.2024', '16.05.2024', '18.05.2024', '20.05.2024', '15.07.2024', '15.07.2024',
             '17.07.2024', '19.07.2024', '21.07.2024', '22.07.2024'],
    'Place': ['м. Коржун', 'м. Бархот', 'Аманат', 'м. Тополев', 'Карсакбай', 'м. Волчий', 'м. Коржун', 'м. Бархот', 'Аманат',
              'м. Тополев', 'Карсакбай', 'м. Волчий'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4],
    'лещ': [52, 86, 15, 28, 14, 40, 51, 21, 50, 74, 13, 35],
    'судак': [0, 17, 6, 1, 1, 0, 5, 0, 1, 0, 4, 3],
    'окунь': [4, 18, 6, 6, 2, 140, 0, 0, 4, 0, 0, 5],
    'плотва': [3, 8, 10, 3, 0, 0, 0, 0, 1, 2, 4, 2],
    'щука': [0, 0, 0, 0, 0, 13, 2, 0, 0, 1, 0, 0],
    'сазан': [0, 0, 0, 0, 13, 0, 1, 1, 9, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0],
    'карась': [1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0]
})
data_2024_1.insert(loc = 4, column='CatchType', value='научный')
data_2024_1.loc[data_2024_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_1.loc[data_2024_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_1.insert(loc=1, column='Year', value=2024)

data_2024_2 = pd.DataFrame.from_dict({
    'Date': ['17.05.2024', '17.05.2024', '19.05.2024', '19.05.2024', '21.05.2024', '21.05.2024', '20.07.2024', '20.07.2024',
             '22.07.2024', '22.07.2024', '23.07.2024', '23.07.2024'],
    'Place': ['м. Тополев', 'м. Тополев', 'Карсакбай', 'Карсакбай', 'м. Волчий', 'м. Волчий', 'м. Тополев', 'м. Тополев',
              'Карсакбай', 'Карсакбай', 'м. Волчий', 'м. Волчий'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [7, 15, 4, 4, 13, 4, 10, 3, 35, 31, 14, 10],
    'судак': [10, 8, 3, 5, 5, 1, 12, 6, 15, 10, 8, 7],
    'окунь': [7, 5, 4, 5, 4, 8, 1, 1, 1, 1, 6, 5],
    'плотва': [16, 12, 5, 10, 15, 7, 3, 2, 4, 3, 6, 6],
    'щука': [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
    'сазан': [0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0],
    'язь': [0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0],
    'карась': [9, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'ерш': [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0]
})
data_2024_2.insert(loc = 4, column='CatchType', value='научный')
data_2024_2.loc[data_2024_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_2.loc[data_2024_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_2.insert(loc=1, column='Year', value=2024)

data_2024_3 = pd.DataFrame.from_dict({
    'Date': ['11.05.2024', '11.05.2024', '12.05.2024', '12.05.2024', '13.05.2024', '13.05.2024', '15.05.2024', '15.05.2024',
             '15.07.2024', '15.07.2024', '16.07.2024', '16.07.2024', '17.07.2024', '17.07.2024', '18.07.2024', '18.07.2024'],
    'Place': ['м. Коржун', 'м. Коржун', 'м. Бархот', 'м. Бархот', 'Аманат', 'Аманат', 'Кара Ертис', 'Кара Ертис', 'м. Коржун',
              'м. Коржун', 'м. Бархот', 'м. Бархот', 'Аманат', 'Аманат', 'Кара Ертис', 'Кара Ертис'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [26, 18, 91, 104, 155, 127, 5, 3, 3, 0, 6, 7, 15, 9, 4, 3],
    'судак': [5, 4, 17, 26, 27, 25, 0, 0, 4, 3, 35, 21, 9, 12, 0, 0],
    'окунь': [1, 1, 5, 2, 4, 3, 4, 4, 10, 5, 4, 2, 5, 5, 6, 6],
    'плотва': [0, 0, 8, 12, 8, 7, 3, 3, 10, 9, 15, 8, 5, 5, 7, 6],
    'щука': [0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0],
    'сазан': [0, 0, 2, 2, 0, 1, 0, 0, 0, 0, 1, 2, 2, 4, 0, 0],
    'язь': [0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 8],
    'карась': [0, 0, 0, 0, 0, 3, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
    'ерш': [1, 2, 20, 18, 26, 18, 0, 0, 5, 4, 0, 0, 0, 0, 0, 0]
})
data_2024_3.insert(loc = 4, column='CatchType', value='научный')
data_2024_3.loc[data_2024_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_3.loc[data_2024_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_3.insert(loc=1, column='Year', value=2024)

data_2024_4 = pd.DataFrame.from_dict({
    'Date': ['17.07.2024', '18.07.2024', '18.07.2024', '19.07.2024', '23.09.2024', '23.09.2024', '23.09.2024', '23.09.2024', '24.09.2024'],
    'Place': ['Аманат', 'м. Тополев', 'м. Тополев', 'Байтогас', 'Камышзавод', 'Причал', 'Бесшана', 'Бесшана', 'Байтогас'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [600, 400, 400, 400, 400, 450, 400, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [612, 6122, 816, 1520, 7971, 1947, 3673, 2041, 7755],
    'судак': [132, 185, 159, 40, 415, 269, 388, 326, 93],
    'окунь': [243, 81, 81, 29, 43, 27, 32, 27, 16],
    'плотва': [72, 36, 36, 72, 7, 109, 109, 7, 72],
    'щука': [40, 20, 20, 2, 16, 19, 22, 10, 0],
    'язь': [3, 3, 3, 3, 3, 3, 3, 3, 0],
    'карась': [2, 0, 1, 0, 1, 2, 2, 0, 0]
})
data_2024_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2024_4.loc[data_2024_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_4.loc[data_2024_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_4.insert(loc=1, column='Year', value=2024)

data_2024_5 = pd.DataFrame.from_dict({
    'Date': ['08.03.2024', '10.03.2024', '23.09.2024', '24.09.2024', '24.09.2024', '24.09.2024', '24.09.2024'],
    'Place': ['Тугыл', 'Байтогас', 'Камышзавод', 'Ултарак', 'Ултарак', 'Ултарак', 'Ултарак'],
    'Instrument': ['сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 50, 50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [39, 28, 102, 327, 367, 155, 124],
    'судак': [19, 20, 16, 93, 109, 41, 408],
    'окунь': [10, 16, 0, 16, 14, 0, 16],
    'плотва': [12, 0, 0, 0, 0, 0, 0],
    'щука': [5, 5, 5, 3, 4, 5, 2],
    'карась': [0, 0, 1, 0, 0, 0, 0]
})
data_2024_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2024_5.loc[data_2024_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_5.loc[data_2024_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_5.insert(loc=1, column='Year', value=2024)

data_2024_6 = pd.DataFrame.from_dict({
    'Date': ['06.03.2024', '07.03.2024', '07.03.2024', '07.03.2024', '21.09.2024', '21.09.2024'],
    'Place': ['р/у№7', 'Жолнускау', 'Жолнускау', 'Жолнускау', 'р/у№7', 'р/у№7'],
    'Instrument': ['сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [34, 50, 45, 67, 122, 120],
    'судак': [9, 44, 46, 36, 28, 37],
    'окунь': [10, 34, 37, 36, 0, 16],
    'плотва': [0, 25, 37, 30, 0, 0],
    'щука': [0, 5, 6, 4, 6, 9]
})
data_2024_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2024_6.loc[data_2024_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2024_6.loc[data_2024_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2024_6.insert(loc=1, column='Year', value=2024)

# общий улов в 2024 году
zhaysan_catch_2024 = pd.concat([data_2024_1, data_2024_2, data_2024_3, data_2024_4, data_2024_5, data_2024_6], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в 2024 году
qty_treated_fish_2024 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ': [0, 125, 251, 73, 23, 20, 5, 43, 18, 4, 3, 2, 4, 3, 0],
         'судак': [77, 83, 140, 23, 10, 14, 16, 0, 0, 0, 0, 0, 0, 0, 0],
         'окунь': [0, 32, 93, 99, 48, 23, 0, 2, 0, 0, 0, 0, 0, 0, 0],
         'плотва': [0, 65, 120, 114, 35, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'щука': [0, 0, 20, 26, 16, 8, 1, 0, 0, 0, 0, 0, 0, 0, 0],
         'сазан': [0, 9, 18, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'язь': [0, 0, 5, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'карась': [0, 4, 6, 9, 7, 3, 1, 3, 3, 0, 0, 0, 0, 0, 0],
         'линь': [0, 3, 2, 3, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим': [0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})








