import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2015 ГОД
# ============================================================

# Научно-исследовательский неводный улов
data_2015_1 = pd.DataFrame.from_dict({
    'Date': ['15.05.2015', '16.05.2015', '17.05.2015', '17.05.2015', '18.05.2015', '18.05.2015', '19.05.2015', '19.05.2015', '20.05.2015',
             '20.05.2015', '21.05.2015', '22.05.2015', '23.05.2015', '31.07.2015', '31.07.2015', '01.08.2015', '01.08.2015', '01.08.2015',
             '02.08.2015', '02.08.2015', '02.08.2015', '03.08.2015', '03.08.2015', '03.08.2015', '04.08.2015', '04.08.2015', '04.08.2015',
             '06.08.2015', '06.08.2015'],
     'Place': ['Устье р. Кокпекты', 'м. Волчий', 'м. Волчий', 'м. Волчий', 'Актюбек', 'Актюбек', 'Карсакбай', 'Карсакбай', 'м. Тополев',
               'м. Тополев', 'м. Тополев', 'Оз. Соленное', 'Устье р. Кендирлик', 'Устье р. Кокпекты', 'Устье р. Кокпекты', 'м. Волчий',
               'м. Волчий', 'м. Волчий', 'Актюбек', 'Актюбек', 'Актюбек', 'Карсакбай', 'Карсакбай', 'Карсакбай', 'м. Тополев', 'м. Тополев',
               'м. Тополев', 'Устье р. Кендирлик', 'Устье р. Кендирлик'],
     'Instrument': ['Сети 10-80мм', 'Невод', 'Сети 10-80мм', 'Сети 10-80мм', 'Сети 10-80мм', 'Невод', 'Сети 10-80мм', 'Невод',
                    'Невод', 'Сети 10-80мм', 'Сети 10-80мм', 'Сети 10-80мм', 'Сети 10-80мм', 'Сети 10-80мм', 'Сети 30-70мм',
                    'Невод', 'Сети 10-80мм', 'Сети 30-70мм', 'Невод', 'Сети 10-80мм', 'Сети 30-70мм', 'Невод', 'Сети 10-80мм',
                    'Сети 30-70мм', 'Невод', 'Сети 10-80мм', 'Сети 30-70мм', 'Сети 10-80мм', 'Сети 30-70мм'],
     'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
     'Area': [0.0, 0.2, 0.0, 0.0, 0.0, 0.2, 0.0, 0.2, 0.2, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.0, 0.0],
     'лещ': [17, 1, 28, 18, 4, 2, 15, 6, 47, 61, 3, 63, 9, 0, 0, 79, 9, 2, 34, 6, 2, 32, 2, 3, 50, 1, 0, 1, 1],
     'судак': [1, 5, 1, 8, 7, 1, 15, 3, 12, 4, 2, 17, 0, 0, 18, 2, 8, 4, 1, 2, 1, 0, 0, 13, 3, 1, 0, 0, 0],
     'окунь': [9, 11, 7, 16, 5, 0, 29, 6, 0, 0, 0, 4, 35, 14, 4, 0, 33, 30, 0, 25, 8, 0, 7, 2, 0, 32, 1, 5, 5],
     'плотва': [54, 0, 128, 94, 40, 0, 199, 5, 0, 5, 11, 0, 11, 11, 1, 6, 30, 1, 0, 163, 0, 2, 14, 3, 2, 33, 0, 0, 0],
     'щука': [2, 11, 3, 5, 8, 1, 5, 4, 0, 4, 0, 4, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 2, 0, 0, 0, 1],
     'сазан': [2, 0, 0, 0, 2, 0, 1, 0, 0, 0, 0, 4, 4, 3, 0, 0, 3, 0, 0, 2, 4, 0, 0, 0, 0, 0, 0, 6, 0],
     'язь': [6, 0, 1, 0, 0, 0, 9, 0, 0, 0, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0],
     'налим': [0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     'линь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 7, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
     'карась': [7, 0, 3, 0, 1, 0, 4, 0, 0, 0, 0, 3, 1, 3, 0, 0, 1, 1, 0, 6, 3, 0, 5, 5, 0, 0, 0, 1, 1]
})
data_2015_1.insert(loc=4, column='CatchType', value='научный')
data_2015_1.loc[data_2015_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_1.loc[data_2015_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_1.insert(loc=1, column='Year', value=2015)

data_2015_2 = pd.DataFrame.from_dict({
    'Date': ['26.05.2015', '26.05.2015', '27.05.2015', '28.05.2015', '28.05.2015', '29.05.2015', '29.05.2015', '30.05.2015', '30.05.2015',
             '31.05.2015', '09.08.2015', '09.08.2015', '10.08.2015', '10.08.2015', '12.08.2015', '12.08.2015', '13.08.2015', '13.08.2015',
             '13.08.2015', '14.08.2015', '14.08.2015'],
    'Place': ['Шенгелди', 'Шенгелди', 'Аманат', 'Аманат', 'м. Бархот', 'м. Бархот', 'Аксуат', 'Аксуат', 'м. Коржын', 'м. Коржын', 'Шенгелди',
              'Шенгелди', 'Аманат', 'Аманат', 'м. Бархот', 'м. Бархот', 'Аксуат', 'Аксуат', 'м. Коржын', 'м. Коржын', 'м. Коржын'],
    'Instrument': ['Невод', 'Сети 10-80мм', 'Невод', 'Сети 10-80мм', 'Невод', 'Сети 10-80мм', 'Невод', 'Сети 10-80мм', 'Невод', 'Сети 10-80мм',
                   'Сети 10-80мм', 'Сети 30-70мм', 'Сети 10-80мм', 'Сети 30-70мм', 'Сети 10-80мм', 'Сети 30-70мм', 'Сети 10-80мм', 'Сети 30-70мм',
                   'Невод', 'Сети 10-80мм', 'Сети 30-70мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.0, 0.2, 0.0, 0.2, 0.0, 0.2, 0.0, 0.2, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.2, 0.0, 0.0],
    'лещ': [1, 3, 75, 6, 34, 13, 6, 4, 72, 4, 3, 3, 2, 1, 3, 3, 2, 3, 18, 2, 6],
    'судак': [2, 3, 11, 3, 5, 24, 8, 6, 12, 1, 1, 0, 4, 3, 3, 3, 0, 1, 4, 2, 4],
    'окунь': [0, 6, 0, 12, 0, 4, 0, 3, 0, 26, 80, 14, 0, 0, 1, 0, 21, 1, 1, 10, 3],
    'плотва': [38, 0, 70, 0, 33, 0, 21, 0, 69, 19, 1, 13, 7, 15, 4, 53, 5, 8, 66, 11, 0],
    'щука': [1, 1, 0, 0, 14, 2, 1, 0, 2, 3, 0, 1, 1, 3, 0, 0, 0, 0, 5, 0, 0],
    'язь': [0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'сазан': [2, 1, 0, 0, 0, 1, 0, 0, 0, 2, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'налим': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'линь': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'карась': [0, 0, 0, 0, 1, 0, 4, 0, 12, 1, 0, 1, 0, 0, 1, 1, 2, 0, 0, 3, 2]
})
data_2015_2.insert(loc=4, column='CatchType', value='научный')
data_2015_2.loc[data_2015_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_2.loc[data_2015_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_2.insert(loc=1, column='Year', value=2015)

# Промысловый неводный улов по Тарбагатайскому побережью
data_2015_3 = pd.DataFrame.from_dict({
    'Date': ['13.03.2015', '14.03.2015', '14.03.2015', '08.04.2015', '08.04.2015', '04.08.2015'],
    'Place': ['Камышзавод', 'Камышзавод', 'Камышзавод', 'Камышзавод', 'Камышзавод', 'м.Тополев'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400, 500, 500, 400],
    'Area': [2.4, 2.4, 2.4, 3.0, 3.0, 8.4],
    'лещ': [634, 521, 528, 352, 299, 228],
    'судак': [2, 147, 12, 1, 38, 163],
    'окунь': [23, 2, 17, 0, 11, 0],
    'плотва': [18, 10, 0, 0, 0, 0],
    'щука': [14, 16, 6, 9, 0, 20],
    'сазан': [0, 3, 0, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0],
    'карась': [0, 3, 0, 6, 0, 0],
    'налим': [0, 6, 0, 0, 0, 0]
})
data_2015_3.insert(loc = 4, column='CatchType', value='промысловый')
data_2015_3.loc[data_2015_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_3.loc[data_2015_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_3.insert(loc=1, column='Year', value=2015)

# Промысловый неводный улов по Курчумскому побережью
data_2015_4 = pd.DataFrame.from_dict({
    'Date': ['15.03.2015', '15.03.2015', '15.03.2015', '15.03.2015', '15.03.2015', '09.08.2015', '09.08.2015',
             '10.08.2015', '11.08.2015', '11.08.2015', '12.08.2015'],
    'Place': ['Аманат', 'Аманат', 'Аманат', 'Аманат', 'Аманат', 'Аманат', 'Аманат', 'Аманат', 'Бархот', 'Бархот', 'Аксуат'],
    'Instrument': ['невод', 'невод', 'невод', 'невод','невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'сеть'],
    'Instrument_size': [600, 600, 600, 600, 600, 600, 600, 600, 400, 500, 400],
    'Area': [3.6, 3.6, 3.5, 3.6, 3.6, 8.4, 8.4, 8.4, 8.4, 8.4, 0.0],
    'лещ': [275, 211, 521, 352, 761, 528, 341, 563, 23, 176, 0],
    'судак': [59, 112, 6, 28, 3, 159, 154, 93, 25, 28, 18],
    'окунь': [46, 7, 27, 9, 7, 10, 0, 2, 0, 0, 0],
    'плотва': [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
    'щука': [25, 7, 22, 10, 4, 20, 20, 7, 7, 3, 5]
})
data_2015_4.insert(loc=4, column='CatchType', value='промысловый')
data_2015_4.loc[data_2015_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2015_4.loc[data_2015_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2015_4.insert(loc=1, column='Year', value=2015)

# общий улов в 2015 году
zhaysan_catch_2015 = pd.concat([data_2015_1, data_2015_2, data_2015_3, data_2015_4], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке в 2015 году
qty_treated_fish_2015 = pd.DataFrame.from_dict({
    'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
    'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
    'лещ':     [6,	18,	72,	95,	75,	59,	32,	25,	18,	11,	15,	11,	10,	2,	1],
    'судак':   [6,	19,	93,	45,	21,	4,	1,	0, 0, 0, 0, 0, 0, 0, 0],
    'окунь':   [10, 35, 68, 99, 63, 33, 11, 15, 5, 5, 0, 0, 0, 0, 0],
    'плотва':  [23, 90, 124, 90, 44, 6, 12, 3,	4, 0, 0, 0, 0, 0, 0],
    'щука':    [0,	1,	23,	50,	47,	11,	4,	2,	0, 0, 0, 0, 0, 0, 0],
    'сазан':   [1,	2,	12,	14,	5,	12,	0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь':     [0,	3,	1,	15,	7,	6,	3,	3,	0, 0, 0, 0, 0, 0, 0],
    'карась':  [0,	2,	6,	30,	21,	13,	11,	3,	2,	0, 0, 0, 0, 0, 0],
    'линь':    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
})


if __name__ == '__main__':
    print(zhaysan_catch_2015.shape)
    print(zhaysan_catch_2015.columns)
    print(zhaysan_catch_2015[['Date', 'Year']])
