import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2023 ГОД
# ============================================================

data_2023_1 = pd.DataFrame.from_dict({
    'Date': ['15.05.2023', '17.05.2023', '18.05.2023', '22.05.2023', '24.05.2023', '25.05.2023', '07.08.2023', '10.08.2023',
             '11.08.2023', '14.08.2023', '16.08.2023', '18.08.2023'],
    'Place': ['м. Коржун', 'м. Бархот', 'Аманат', 'м. Тополев', 'Карсакбай', 'м. Волчий', 'м. Волчий', 'п. Карсакбай', 'м. Тополев', 'Аманат', 'м. Бархот', 'м. Коржун'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4],
    'лещ': [18, 263, 28, 0, 28, 15, 7, 10, 26, 14, 8, 7],
    'судак': [2, 6, 2, 3, 2, 3, 12, 5, 8, 9, 12, 4],
    'окунь': [6, 5, 7, 17, 19, 30, 0, 7, 14, 8, 10, 4],
    'плотва': [0, 0, 0, 0, 0, 10, 5, 0, 6, 0, 4, 0],
    'щука': [0, 1, 0, 3, 0, 2, 0, 0, 1, 1, 0, 0],
    'сазан': [0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь': [0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'карась': [0, 0, 0, 0, 0, 0, 1, 0, 0, 3, 1, 1],
    'ерш': [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})
data_2023_1.insert(loc = 4, column='CatchType', value='научный')
data_2023_1.loc[data_2023_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_1.loc[data_2023_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_1.insert(loc=1, column='Year', value=2023)

data_2023_2 = pd.DataFrame.from_dict({
    'Date': ['23.05.2023', '23.05.2023', '25.05.2023', '25.05.2023', '26.05.2023', '26.05.2023', '08.08.2023', '08.08.2023',
             '10.08.2023', '10.08.2023', '12.08.2023', '12.08.2023'],
    'Place': ['м. Тополев', 'м. Тополев', 'Карсакбай', 'Карсакбай', 'м. Волчий', 'м. Волчий', 'м. Волчий', 'м. Волчий',
              'Карсакбай', 'Карсакбай', 'м. Тополев', 'м. Тополев'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [10, 7, 7, 5, 15, 18, 5, 7, 9, 6, 11, 7],
    'судак': [2, 1, 2, 1, 5, 3, 15, 19, 6, 5, 3, 4],
    'окунь': [16, 10, 12, 10, 12, 16, 11, 20, 6, 5, 13, 11],
    'плотва': [10, 18, 17, 12, 24, 18, 11, 14, 7, 9, 9, 9],
    'щука': [0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 1],
    'линь': [0, 0, 0, 0, 0, 0, 2, 3, 0, 0, 0, 0],
    'ерш': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})
data_2023_2.insert(loc = 4, column='CatchType', value='научный')
data_2023_2.loc[data_2023_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_2.loc[data_2023_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_2.insert(loc=1, column='Year', value=2023)

data_2023_3 = pd.DataFrame.from_dict({
    'Date': ['16.05.2023', '16.05.2023', '18.05.2023', '18.05.2023', '19.05.2023', '19.05.2023', '21.05.2023', '21.05.2023',
             '13.08.2023', '13.08.2023', '15.08.2023', '15.08.2023', '17.08.2023', '17.08.2023', '19.08.2023', '19.08.2023'],
    'Place': ['м. Коржун', 'м. Коржун', 'м. Бархот', 'м. Бархот', 'м. Коржун', 'м. Коржун', 'Кара-Ертис', 'Кара-Ертис',
              'Кара-Ертис', 'Кара-Ертис', 'Аманат', 'Аманат', 'м. Бархот', 'м. Бархот', 'м. Коржун', 'м. Коржун'],
    'Instrument': ['сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм', 'сети 20-80 мм',
                   'сети 20-80 мм', 'сети 20-80 мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [26, 19, 13, 16, 5, 6, 10, 11, 3, 2, 2, 4, 6, 1, 4, 5],
    'судак': [7, 8, 5, 3, 1, 6, 0, 2, 0, 0, 5, 12, 4, 7, 8, 4],
    'окунь': [19, 19, 0, 1, 10, 6, 9, 10, 4, 4, 11, 6, 4, 8, 1, 4],
    'плотва': [9, 18, 0, 0, 0, 3, 6, 10, 4, 7, 14, 11, 4, 4, 5, 5],
    'щука': [0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0],
    'сазан': [1, 0, 1, 3, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0],
    'язь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 8],
    'карась': [1, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 2, 0, 0, 0, 0],
    'толстолобик': [0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 0, 2, 0, 0, 0, 0],
    'линь': [1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0],
    'ерш': [5, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})
data_2023_3.insert(loc = 4, column='CatchType', value='научный')
data_2023_3.loc[data_2023_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_3.loc[data_2023_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_3.insert(loc=1, column='Year', value=2023)

data_2023_4 = pd.DataFrame.from_dict({
    'Date': ['09.08.2023', '09.08.2023', '11.08.2023', '11.08.2023', '06.10.2023', '06.10.2023', '07.10.2023'],
    'Place': ['уч. Бесшана', 'Карсакбай', 'м. Тополев', 'м. Тополев', 'уч. Бесшана', 'Карсакбай', 'Ултарак'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [250, 400, 400, 450, 400, 400, 400],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [1891, 2432, 2162, 2432, 810, 2162, 1351],
    'судак': [16, 117, 67, 405, 94, 108, 270],
    'окунь': [45, 136, 68, 68, 45, 218, 45],
    'плотва': [83, 41, 125, 83, 83, 41, 41],
    'щука': [4, 2, 5, 5, 15, 15, 15],
    'язь': [0, 0, 0, 0, 0, 33, 0]
})
data_2023_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2023_4.loc[data_2023_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_4.loc[data_2023_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_4.insert(loc=1, column='Year', value=2023)

data_2023_5 = pd.DataFrame.from_dict({
    'Date': ['13.08.2023', '13.08.2023', '13.08.2023', '05.10.2023', '05.10.2023', '05.10.2023'],
    'Place': ['Аманат', 'Аманат', 'Аманат', 'уч. Кызылжар', 'Аманат', 'Аманат'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [500, 540, 500, 600, 600, 600],
    'Area': [5.2, 5.2, 5.2, 5.2, 5.2, 5.2],
    'лещ': [3270, 3542, 3270, 810, 540, 1351],
    'судак': [162, 135, 135, 337, 405, 135],
    'окунь': [90, 22, 45, 90, 68, 45],
    'плотва': [83, 125, 83, 83, 125, 83],
    'щука': [2, 1, 2, 20, 15, 10],
    'сазан': [10, 5, 17, 0, 0, 0],
    'налим': [0, 0, 0, 10, 5, 0]
})
data_2023_5.insert(loc = 4, column='CatchType', value='промысловый')
data_2023_5.loc[data_2023_5['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_5.loc[data_2023_5['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_5.insert(loc=1, column='Year', value=2023)

data_2023_6 = pd.DataFrame.from_dict({
    'Date': ['12.02.2023', '12.02.2023', '12.02.2023', '13.02.2023', '13.02.2023', '09.08.2023', '09.08.2023', '06.10.2023',
             '07.10.2023', '07.10.2023', '07.10.2023'],
    'Place': ['р/у №3', 'р/у №3', 'р/у №3', 'р/у №2', 'р/у №2', 'Ултарак', 'Ултарак', 'Тополев', 'Актубек', 'Актубек', 'Актубек'],
    'Instrument': ['сети 50-55 мм', 'сети 55-60 мм', 'сети 50-55 мм', 'сети 50-60 мм', 'сети 50-70 мм', 'сети 50-55 мм',
                   'сети 50-55 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
    'лещ': [40, 85, 39, 29, 43, 81, 108, 67, 94, 102, 81],
    'судак': [28, 23, 21, 20, 14, 27, 40, 40, 33, 32, 27],
    'окунь': [10, 0, 18, 3, 3, 22, 22, 45, 22, 18, 13],
    'плотва': [0, 0, 0, 6, 0, 0, 0, 0, 16, 25, 33],
    'щука': [5, 4, 6, 4, 2, 3, 4, 10, 2, 1, 2],
    'язь': [0, 0, 0, 0, 0, 2, 1, 0, 0, 0, 0],
    'карась': [0, 0, 0, 2, 0, 1, 1, 0, 0, 0, 0]
})
data_2023_6.insert(loc = 4, column='CatchType', value='промысловый')
data_2023_6.loc[data_2023_6['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_6.loc[data_2023_6['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_6.insert(loc=1, column='Year', value=2023)

data_2023_7 = pd.DataFrame.from_dict({
    'Date': ['15.02.2023', '15.02.2023', '17.02.2023', '05.10.2023'],
    'Place': ['р/у №3', 'р/у №3', 'р/у №3', 'Жолнускау'],
    'Instrument': ['сети 50-55 мм', 'сети 50-55 мм', 'сети 50-55 мм', 'сети 50 мм'],
    'Instrument_size': [50, 50, 50, 50],
    'Area': [0.0, 0.0, 0.0, 0.0],
    'лещ': [49, 27, 29, 108],
    'судак': [28, 16, 24, 47],
    'окунь': [14, 0, 14, 22],
    'плотва': [7, 0, 0, 0],
    'щука': [8, 7, 6, 5],
    'карась': [4, 10, 15, 0]
})
data_2023_7.insert(loc = 4, column='CatchType', value='промысловый')
data_2023_7.loc[data_2023_7['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2023_7.loc[data_2023_7['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2023_7.insert(loc=1, column='Year', value=2023)

# общий улов в 2023 году
zhaysan_catch_2023 = pd.concat([data_2023_1, data_2023_2, data_2023_3, data_2023_4, data_2023_5, data_2023_6, data_2023_7], ignore_index=True)


# Количество рыб, подвергнутых биологической обработке в  2023 году
qty_treated_fish_2023 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ': [0, 37, 105, 77, 45, 74, 120, 58, 11, 11, 8, 3, 1, 0, 0],
         'судак': [8, 101, 117, 44, 10, 5, 18, 0, 0, 0, 0, 0, 0, 0, 0],
         'окунь': [0, 25, 52, 101, 118, 23, 13, 6, 11, 0, 0, 0, 0, 0, 0],
         'плотва': [0, 33, 161, 145, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'щука': [0, 0, 11, 22, 34, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0],
         'сазан': [0, 0, 17, 6, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'язь': [0, 0, 15, 17, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'карась': [0, 0, 4, 36, 31, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'линь': [0, 0, 9, 4, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})



