import pandas as pd

# ============================================================
# ДАННЫЕ ОЗЕРА ЖАЙСАН ЗА 2016 ГОД
# ============================================================

# Научно-исследовательский неводный улов
data_2016_1 = pd.DataFrame.from_dict({
    'Date': ['19.05.2016', '20.05.2016', '21.05.2016', '21.05.2016', '22.05.2016', '22.05.2016', '22.05.2016', '23.05.2016', '23.05.2016',
             '23.05.2016', '24.05.2016', '25.05.2016', '06.07.2016', '06.07.2016', '07.07.2016', '07.07.2016', '08.07.2016', '09.07.2016',
             '09.07.2016', '09.07.2016', '10.07.2016', '10.07.2016', '10.07.2016', '12.07.2016'],
    'Place': ['м.Тополев', 'м.Тополев', 'м.Тополев', 'Карсакбай', 'Карсакбай', 'Карсакбай', 'Актюбек', 'Актюбек', 'Актубек', 'м. Волчий', 'м. Волчий',
              'м. Волчий', 'Устье р.Кокпекты', 'м. Волчий', 'м. Волчий', 'Актюбек', 'Актюбек', 'Карсакбай', 'Карсакбай', 'Карсакбай', 'м. Тополев',
              'м. Тополев', 'м. Тополев', 'Соленое'],
    'Instrument': ['Невод', 'Сети 10-80', 'Сети 10-80', 'Невод', 'Сети 10-80мм', 'Сети 30-80мм', 'Невод', 'Сети 30-80мм', 'Сети 30-80мм', 'Невод',
                   'Сети 10-80мм', 'Сети 30-80мм', 'Сети 10-80мм', 'Невод', 'Сети 10-80', 'Невод', 'Сети 10-80мм', 'Невод', 'Сети 10-80мм',
                   'Сети 30-70мм', 'Невод 100м', 'Сети 10-80мм', 'Сети 30-70мм', 'Сети 10-80'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.0, 0.2, 0.0, 0.2, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.0],
    'лещ': [41, 7, 12, 10, 7, 19, 4, 29, 25, 1, 19, 26, 2, 186, 5, 38, 3, 18, 3, 3, 10, 5, 16, 2],
    'судак': [0, 5, 1, 1, 1, 4, 7, 8, 1, 0, 3, 3, 0, 2, 0, 0, 1, 6, 1, 4, 3, 4, 1, 2],
    'окунь': [3, 18, 5, 5, 8, 22, 5, 30, 13, 1, 41, 27, 10, 7, 99, 36, 79, 0, 8, 2, 0, 83, 11, 20],
    'плотва': [1, 50, 39, 0, 69, 15, 40, 6, 21, 0, 11, 16, 6, 21, 76, 3, 71, 3, 60, 6, 1, 46, 19, 15],
    'щука': [3, 1, 2, 3, 2, 7, 8, 4, 5, 0, 5, 5, 1, 4, 7, 0, 4, 0, 1, 0, 5, 0, 0, 3],
    'сазан': [0, 1, 1, 2, 0, 1, 3, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
    'язь': [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'налим': [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0],
    'линь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'карась': [1, 0, 1, 4, 2, 0, 2, 6, 6, 3, 12, 16, 41, 0, 9, 0, 2, 0, 0, 0, 0, 0, 0, 0]
})
data_2016_1.insert(loc = 4, column='CatchType', value='научный')
data_2016_1.loc[data_2016_1['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_1.loc[data_2016_1['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_1.insert(loc=1, column='Year', value=2016)

data_2016_2 = pd.DataFrame.from_dict({
    'Date': ['13.05.2016', '13.05.2016', '13.05.2016', '15.05.2016', '16.05.2016', '16.05.2016', '16.07.2016', '17.07.2016', '17.07.2016', '17.07.2016',
              '18.07.2016', '18.07.2016', '18.05.2016', '18.05.2016', '19.07.2016', '19.07.2016', '19.07.2016', '20.07.2016', '21.07.2016', '21.07.2016'],
    'Place': ['Аксуат', 'Аксуат', 'Аксуат', 'м. Бархот', 'м. Бархот', 'м. Бархот', 'Шенгелди', 'Шенгелди', 'Шенгелди', 'Аманат',
              'Аманат', 'Аманат', 'Шенгелди', 'Шенгелди', 'м. Бархот', 'м. Бархот', 'м. Бархот', 'Аксуат', 'Аксуат', 'Аксуат'],
    'Instrument': ['Невод 100м', 'Сети 10-80мм', 'Сети 30-80мм', 'Невод 100м', 'Сети 10-80мм', 'Сети 30-80мм', 'Невод 100м', 'Сети 10-70мм', 'Сети 30-80мм',
                   'Невод 100м', 'Сети 10-80мм', 'Сети 30-70мм', 'Сети 10-80мм', 'Сети 30-80мм', 'Невод 100м', 'Сети 10-80мм', 'Сети 30-70мм', 'Невод 100м',
                   'Сети 10-80мм', 'Сети 30-70мм'],
    'Instrument_size': [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100],
    'Area': [0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0, 0.0, 0.0, 0.2, 0.0, 0.0, 0.2, 0.0, 0.0],
    'лещ': [30, 4, 0, 25, 24, 9, 47, 0, 5, 4, 12, 4, 14, 7, 31, 6, 11, 12, 9, 21],
    'судак': [1, 4, 3, 2, 0, 9, 27, 1, 0, 3, 6, 8, 0, 0, 7, 2, 0, 4, 10, 7],
    'окунь': [3, 16, 6, 0, 0, 1, 1, 47, 16, 4, 36, 0, 3, 2, 1, 9, 2, 3, 9, 13],
    'плотва': [1, 59, 0, 0, 27, 2, 0, 13, 1, 0, 25, 22, 8, 11, 1, 19, 19, 0, 25, 8],
    'щука': [0, 0, 5, 0, 0, 0, 0, 0, 1, 3, 0, 3, 7, 3, 3, 1, 0, 0, 1, 0],
    'язь': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 11, 6, 2, 0, 0, 0, 0, 0],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'линь': [0, 0, 0, 0, 0, 0, 0, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'карась': [0, 2, 0, 4, 4, 1, 0, 0, 0, 1, 0, 2, 1, 0, 0, 0, 0, 0, 0, 0]
})
data_2016_2.insert(loc = 4, column='CatchType', value='научный')
data_2016_2.loc[data_2016_2['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_2.loc[data_2016_2['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_2.insert(loc=1, column='Year', value=2016)

# Промысловый неводный улов по Тарбагатайскому побережью
data_2016_3 = pd.DataFrame.from_dict({
    'Date': ['08.07.2016', '09.07.2016', '10.07.2016', '11.07.2016', '17.09.2016', '18.09.2016', '18.09.2016', '18.09.2016',
             '18.09.2016', '18.09.2016', '18.09.2016', '19.09.2016'],
    'Place': ['Актубек', 'м.Тополев', 'Бесшана', 'Камышзавод', 'Тугыл', 'Актубек', 'Актубек', 'Тугыл', 'Тугыл', 'Тугыл',
              'Камышзавод', 'Камышзавод'],
    'Instrument': ['невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400],
    'Area': [3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6],
    'лещ': [500, 783, 566, 450, 637, 667, 200, 333, 233, 833, 500, 667],
    'судак': [133, 44, 122, 55, 11, 117, 5, 22, 33, 14, 44, 139],
    'окунь': [13, 0, 13, 7, 7, 7, 7, 0, 0, 7, 0, 13],
    'плотва': [244, 111, 55, 56, 0, 55, 55, 55, 55, 0, 0, 0],
    'язь': [10, 15, 5, 10, 1, 10, 10, 2, 5, 0, 0, 5],
    'сазан': [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
    'щука': [10, 15, 5, 10, 1, 10, 10, 2, 5, 0, 0, 5],
    'карась': [40, 0, 30, 0, 2, 10, 20, 0, 0, 0, 0, 0]
})
data_2016_3.insert(loc = 4, column='CatchType', value='промысловый')
data_2016_3.loc[data_2016_3['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_3.loc[data_2016_3['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_3.insert(loc=1, column='Year', value=2016)

# Промысловый неводный улов по Курчумскому побережью — строки
data_2016_4 = pd.DataFrame.from_dict({
    'Date': ['18.07.2016', '18.07.2016', '20.07.2016', '21.07.2016', '20.09.2016', '20.09.2016', '20.09.2016', '20.09.2016', '20.09.2016'],
    'Place': ['Аманат', 'Аманат', 'Бархот', 'Аксуат', 'Аманат', 'Аманат', 'Аманат', 'Аманат', 'Бархот'],
    'Instrument': ['невод', 'невод', 'невод', 'невод','невод', 'невод', 'невод', 'невод', 'невод'],
    'Instrument_size': [400, 400, 400, 400, 400, 400, 400, 400, 400],
    'Area': [3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6, 3.6],
    'лещ': [177, 17, 133, 17, 117, 167, 583, 500, 583],
    'судак': [33, 19, 22, 11, 33, 33, 183, 67, 55],
    'окунь': [13, 0, 13, 33, 0, 0, 0, 0, 0],
    'плотва': [55, 0, 0, 55, 55, 0, 0, 55, 0],
    'щука': [10, 3, 0, 5, 0, 20, 0, 3, 0],
    'карась': [0, 0, 0, 0, 20, 20, 0, 20, 0]
})
data_2016_4.insert(loc = 4, column='CatchType', value='промысловый')
data_2016_4.loc[data_2016_4['Instrument'].str.contains('ево', na=False), 'Instrument'] = 'невод'
data_2016_4.loc[data_2016_4['Instrument'].str.contains('ет', na=False), 'Instrument'] = 'сеть'
data_2016_4.insert(loc=1, column='Year', value=2016)

# общий улов в 2016 году
zhaysan_catch_2016 = pd.concat([data_2016_1, data_2016_2, data_2016_3, data_2016_4], ignore_index=True)

# Количество рыб, подвергнутых биологической обработке в 2016 году
qty_treated_fish_2016 = pd.DataFrame.from_dict({
        'LessAge': ['less_2', 'less_3', 'less_4', 'less_5', 'less_6', 'less_7', 'less_8', 'less_9', 'less_10', 'less_11', 'less_12', 'less_13', 'less_14', 'less_15', 'less_16'],
        'age': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
         'лещ':     [6,	10,	94,	103, 68, 47, 41, 39, 29, 8,	9, 3, 1, 0, 0],
         'судак':   [4,	19,	125, 141, 36,	21,	12,	4, 0, 0, 0, 0, 0, 0, 0],
         'окунь':   [6,	28,	88,	97,	75,	13,	5,	3,	1,	1,	0,	0, 0, 0, 0],
         'плотва':  [5,	63,	124, 84, 37, 10, 3, 0, 0, 0, 0, 0, 0, 0, 0],
         'щука':    [1,	2,	41,	52,	59,	8,	13,	0,	3, 0, 0, 0, 0, 0, 0],
         'сазан':   [0, 0, 17, 37, 4, 4, 1, 1, 0, 0, 0, 0, 0, 0, 0],
         'язь':     [0,	0,	3,	3,	3,	9,	10,	0,	4,	1,	0, 0, 0, 0, 0],
         'карась':  [0,	7,	32,	30,	7,	17,	13,	4,	5,	3,	0,	0, 0, 0, 0],
         'линь':    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         'налим':   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
})
